<?xml version="1.0"?>
<GCC_XML cvs_revision="1.135">
  <Namespace id="_1" name="::" members="_3 _4 _5 _6 _8 _9 _10 _11 _12 _13 _14 _16 _15 _17 _18 _19 _20 _22 _21 _23 _25 _24 _26 _27 _28 _29 _30 _31 _32 _33 _34 _35 _36 _38 _39 _40 _41 _42 _43 _45 _44 _46 _47 _48 _49 _50 _51 _52 _53 _54 _55 _56 _57 _59 _61 _60 _63 _62 _64 _65 _66 _67 _68 _69 _70 _72 _73 _74 _75 _76 _77 _78 _79 _81 _80 _83 _82 _84 _85 _86 _88 _87 _89 _90 _92 _91 _94 _93 _96 _95 _97 _98 _99 _101 _100 _102 _103 _104 _105 _106 _107 _108 _109 _110 _112 _113 _115 _114 _116 _118 _117 _119 _121 _120 _122 _123 _125 _124 _127 _126 _128 _129 _130 _131 _132 _134 _135 _136 _137 _139 _138 _141 _140 _143 _142 _144 _145 _146 _147 _148 _149 _150 _151 _152 _153 _155 _154 _157 _156 _2 _158 _159 _160 _161 _162 _163 _164 _166 _165 _167 _168 _169 _170 _171 _172 _173 _174 _176 _175 _177 _179 _178 _180 _181 _182 _183 _185 _184 _186 _188 _187 _190 _189 _191 _193 _192 _194 _196 _195 _198 _197 _199 _200 _202 _203 _204 _206 _207 _208 _209 _210 _211 _212 _213 _214 _215 _217 _216 _218 _219 _220 _221 _223 _222 _224 _225 _227 _226 _228 _229 _231 _230 _232 _233 _234 _235 _236 _238 _237 _239 _240 _241 _242 _243 _244 _245 _246 _247 _248 _249 _250 _252 _251 _254 _253 _255 _256 _258 _257 _259 _260 _261 _262 _263 _264 _265 _266 _267 _268 _269 _271 _270 _273 _272 _274 _276 _275 _277 _279 _278 _281 _280 _282 _283 _284 _285 _286 " mangled="_Z2::" demangled="::"/>

  <Function id="_263" name="__builtin_ctzll" returns="_71" context="_1" location="f0:98" file="f0" line="98" extern="1" attributes="nothrow const">
    <Argument type="_292" location="f0:98" file="f0" line="98"/>
  </Function>
  <Typedef id="_264" name="uint_fast32_t" type="_7" context="_1" location="f1:107" file="f1" line="107"/>
  <Function id="_265" name="__builtin_cargf" returns="_289" context="_1" mangled="cargf" location="f0:93" file="f0" line="93" extern="1" attributes="nothrow pure no vops">
    <Argument type="_293" location="f0:93" file="f0" line="93"/>
  </Function>
  <Function id="_266" name="__builtin_cargl" returns="_290" context="_1" mangled="cargl" location="f0:95" file="f0" line="95" extern="1" attributes="nothrow pure no vops">
    <Argument type="_294" location="f0:95" file="f0" line="95"/>
  </Function>
  <Function id="_267" name="__builtin_cosf" returns="_289" context="_1" mangled="cosf" location="f0:40" file="f0" line="40" extern="1" attributes="nothrow pure no vops">
    <Argument type="_289" location="f0:40" file="f0" line="40"/>
  </Function>
  <Function id="_268" name="__builtin_cosh" returns="_287" context="_1" mangled="cosh" location="f0:41" file="f0" line="41" extern="1" attributes="nothrow">
    <Argument type="_287" location="f0:41" file="f0" line="41"/>
  </Function>
  <Function id="_269" name="__builtin_cosl" returns="_290" context="_1" mangled="cosl" location="f0:44" file="f0" line="44" extern="1" attributes="nothrow pure no vops">
    <Argument type="_290" location="f0:44" file="f0" line="44"/>
  </Function>
  <Enumeration id="_270" name="SpiceMouseButton" context="_1" location="f2:254" file="f2" line="254" artificial="1" size="32" align="32">
    <EnumValue name="SPICE_MOUSE_BUTTON_INVALID" init="0"/>
    <EnumValue name="SPICE_MOUSE_BUTTON_LEFT" init="1"/>
    <EnumValue name="SPICE_MOUSE_BUTTON_MIDDLE" init="2"/>
    <EnumValue name="SPICE_MOUSE_BUTTON_RIGHT" init="3"/>
    <EnumValue name="SPICE_MOUSE_BUTTON_UP" init="4"/>
    <EnumValue name="SPICE_MOUSE_BUTTON_DOWN" init="5"/>
    <EnumValue name="SPICE_MOUSE_BUTTON_ENUM_END" init="6"/>
  </Enumeration>
  <Typedef id="_271" name="SpiceMouseButton" type="_270" context="_1" location="f2:263" file="f2" line="263"/>
  <Enumeration id="_272" name="SpiceClipType" context="_1" location="f2:79" file="f2" line="79" artificial="1" size="32" align="32">
    <EnumValue name="SPICE_CLIP_TYPE_NONE" init="0"/>
    <EnumValue name="SPICE_CLIP_TYPE_RECTS" init="1"/>
    <EnumValue name="SPICE_CLIP_TYPE_ENUM_END" init="2"/>
  </Enumeration>
  <Typedef id="_273" name="SpiceClipType" type="_272" context="_1" location="f2:84" file="f2" line="84"/>
  <Function id="_274" name="__builtin_isgreater" returns="_291" context="_1" location="f0:137" file="f0" line="137" extern="1" attributes="nothrow const">
    <Ellipsis/>
  </Function>
  <Struct id="_275" name="SpiceLinkHeader" context="_1" mangled="15SpiceLinkHeader" demangled="SpiceLinkHeader" location="f3:47" file="f3" line="47" artificial="1" attributes="__packed__" size="128" align="8" members="_357 _358 _359 _360 _361 _362 _363 _364 " bases=""/>
  <Typedef id="_276" name="SpiceLinkHeader" type="_275" context="_1" location="f3:52" file="f3" line="52"/>
  <Typedef id="_277" name="uint_least8_t" type="_205" context="_1" location="f1:77" file="f1" line="77"/>
  <Enumeration id="_278" name="SpiceMouseButtonMask" context="_1" location="f2:265" file="f2" line="265" artificial="1" size="32" align="32">
    <EnumValue name="SPICE_MOUSE_BUTTON_MASK_LEFT" init="1"/>
    <EnumValue name="SPICE_MOUSE_BUTTON_MASK_MIDDLE" init="2"/>
    <EnumValue name="SPICE_MOUSE_BUTTON_MASK_RIGHT" init="4"/>
    <EnumValue name="SPICE_MOUSE_BUTTON_MASK_MASK" init="7"/>
  </Enumeration>
  <Typedef id="_279" name="SpiceMouseButtonMask" type="_278" context="_1" location="f2:271" file="f2" line="271"/>
  <Enumeration id="_280" name="SpiceMouseMode" context="_1" location="f2:57" file="f2" line="57" artificial="1" size="32" align="32">
    <EnumValue name="SPICE_MOUSE_MODE_SERVER" init="1"/>
    <EnumValue name="SPICE_MOUSE_MODE_CLIENT" init="2"/>
    <EnumValue name="SPICE_MOUSE_MODE_MASK" init="3"/>
  </Enumeration>
  <Typedef id="_281" name="SpiceMouseMode" type="_280" context="_1" location="f2:62" file="f2" line="62"/>
  <Function id="_282" name="__builtin_sinf" returns="_289" context="_1" mangled="sinf" location="f0:76" file="f0" line="76" extern="1" attributes="nothrow pure no vops">
    <Argument type="_289" location="f0:76" file="f0" line="76"/>
  </Function>
  <Function id="_283" name="__builtin_sinh" returns="_287" context="_1" mangled="sinh" location="f0:77" file="f0" line="77" extern="1" attributes="nothrow">
    <Argument type="_287" location="f0:77" file="f0" line="77"/>
  </Function>
  <Function id="_284" name="__builtin_sinl" returns="_290" context="_1" mangled="sinl" location="f0:80" file="f0" line="80" extern="1" attributes="nothrow pure no vops">
    <Argument type="_290" location="f0:80" file="f0" line="80"/>
  </Function>
  <Typedef id="_285" name="uint64_t" type="_7" context="_1" location="f1:56" file="f1" line="56"/>
  <Function id="_286" name="__builtin_csin" returns="_295" context="_1" mangled="csin" location="f0:115" file="f0" line="115" extern="1" attributes="nothrow pure no vops">
    <Argument type="_295" location="f0:115" file="f0" line="115"/>
  </Function>
  <FundamentalType id="_287" name="double" size="64" align="64"/>
  <PointerType id="_288" type="_365c" size="64" align="64"/>
  <FundamentalType id="_289" name="float" size="32" align="32"/>
  <FundamentalType id="_290" name="long double" size="128" align="128"/>
  <FundamentalType id="_291" name="bool" size="8" align="8"/>
  <FundamentalType id="_292" name="long long int" size="64" align="64"/>
  <FundamentalType id="_293" name="complex float" size="64" align="32"/>
  <FundamentalType id="_294" name="complex long double" size="256" align="128"/>
  <FundamentalType id="_295" name="complex double" size="128" align="64"/>
  <Field id="_296" name="serial" type="_285" offset="0" context="_44" access="public" location="f3:87" file="f3" line="87"/>
  <Field id="_297" name="type" type="_202" offset="64" context="_44" access="public" location="f3:88" file="f3" line="88"/>
  <Field id="_298" name="size" type="_112" offset="80" context="_44" access="public" location="f3:89" file="f3" line="89"/>
  <Field id="_299" name="sub_list" type="_112" offset="112" context="_44" access="public" location="f3:90" file="f3" line="90"/>
  <Destructor id="_300" name="SpiceDataHeader" artificial="1" throw="" context="_44" access="public" mangled="_ZN15SpiceDataHeaderD1Ev *INTERNAL* " demangled="SpiceDataHeader::~SpiceDataHeader()" location="f3:86" file="f3" line="86" endline="86" inline="1">
  </Destructor>
  <OperatorMethod id="_301" name="=" returns="_367" artificial="1" throw="" context="_44" access="public" mangled="_ZN15SpiceDataHeaderaSERKS_" demangled="SpiceDataHeader::operator=(SpiceDataHeader const&amp;)" location="f3:86" file="f3" line="86" endline="86" inline="1">
    <Argument type="_368" location="f3:86" file="f3" line="86"/>
  </OperatorMethod>
  <Constructor id="_302" name="SpiceDataHeader" artificial="1" throw="" context="_44" access="public" mangled="_ZN15SpiceDataHeaderC1ERKS_ *INTERNAL* " demangled="SpiceDataHeader::SpiceDataHeader(SpiceDataHeader const&amp;)" location="f3:86" file="f3" line="86" endline="86" inline="1">
    <Argument type="_368" location="f3:86" file="f3" line="86"/>
  </Constructor>
  <Constructor id="_303" name="SpiceDataHeader" artificial="1" throw="" context="_44" access="public" mangled="_ZN15SpiceDataHeaderC1Ev *INTERNAL* " demangled="SpiceDataHeader::SpiceDataHeader()" location="f3:86" file="f3" line="86" inline="1"/>
  <Field id="_304" name="auth_mechanism" type="_112" offset="0" context="_60" access="public" location="f3:83" file="f3" line="83"/>
  <Destructor id="_305" name="SpiceLinkAuthMechanism" artificial="1" throw="" context="_60" access="public" mangled="_ZN22SpiceLinkAuthMechanismD1Ev *INTERNAL* " demangled="SpiceLinkAuthMechanism::~SpiceLinkAuthMechanism()" location="f3:82" file="f3" line="82" endline="82" inline="1">
  </Destructor>
  <OperatorMethod id="_306" name="=" returns="_369" artificial="1" throw="" context="_60" access="public" mangled="_ZN22SpiceLinkAuthMechanismaSERKS_" demangled="SpiceLinkAuthMechanism::operator=(SpiceLinkAuthMechanism const&amp;)" location="f3:82" file="f3" line="82" endline="82" inline="1">
    <Argument type="_370" location="f3:82" file="f3" line="82"/>
  </OperatorMethod>
  <Constructor id="_307" name="SpiceLinkAuthMechanism" artificial="1" throw="" context="_60" access="public" mangled="_ZN22SpiceLinkAuthMechanismC1ERKS_ *INTERNAL* " demangled="SpiceLinkAuthMechanism::SpiceLinkAuthMechanism(SpiceLinkAuthMechanism const&amp;)" location="f3:82" file="f3" line="82" endline="82" inline="1">
    <Argument type="_370" location="f3:82" file="f3" line="82"/>
  </Constructor>
  <Constructor id="_308" name="SpiceLinkAuthMechanism" artificial="1" throw="" context="_60" access="public" mangled="_ZN22SpiceLinkAuthMechanismC1Ev *INTERNAL* " demangled="SpiceLinkAuthMechanism::SpiceLinkAuthMechanism()" location="f3:82" file="f3" line="82" inline="1"/>
  <FundamentalType id="_309" name="void" align="8"/>
  <PointerType id="_310" type="_309" size="64" align="64"/>
  <PointerType id="_311" type="_309c" size="64" align="64"/>
  <PointerType id="_312" type="_71" size="64" align="64"/>
  <Field id="_313" name="type" type="_202" offset="0" context="_87" access="public" location="f3:94" file="f3" line="94"/>
  <Field id="_314" name="size" type="_112" offset="16" context="_87" access="public" location="f3:95" file="f3" line="95"/>
  <Destructor id="_315" name="SpiceMiniDataHeader" artificial="1" throw="" context="_87" access="public" mangled="_ZN19SpiceMiniDataHeaderD1Ev *INTERNAL* " demangled="SpiceMiniDataHeader::~SpiceMiniDataHeader()" location="f3:93" file="f3" line="93" endline="93" inline="1">
  </Destructor>
  <OperatorMethod id="_316" name="=" returns="_372" artificial="1" throw="" context="_87" access="public" mangled="_ZN19SpiceMiniDataHeaderaSERKS_" demangled="SpiceMiniDataHeader::operator=(SpiceMiniDataHeader const&amp;)" location="f3:93" file="f3" line="93" endline="93" inline="1">
    <Argument type="_373" location="f3:93" file="f3" line="93"/>
  </OperatorMethod>
  <Constructor id="_317" name="SpiceMiniDataHeader" artificial="1" throw="" context="_87" access="public" mangled="_ZN19SpiceMiniDataHeaderC1ERKS_ *INTERNAL* " demangled="SpiceMiniDataHeader::SpiceMiniDataHeader(SpiceMiniDataHeader const&amp;)" location="f3:93" file="f3" line="93" endline="93" inline="1">
    <Argument type="_373" location="f3:93" file="f3" line="93"/>
  </Constructor>
  <Constructor id="_318" name="SpiceMiniDataHeader" artificial="1" throw="" context="_87" access="public" mangled="_ZN19SpiceMiniDataHeaderC1Ev *INTERNAL* " demangled="SpiceMiniDataHeader::SpiceMiniDataHeader()" location="f3:93" file="f3" line="93" inline="1"/>
  <PointerType id="_319" type="_289" size="64" align="64"/>
  <PointerType id="_320" type="_290" size="64" align="64"/>
  <Field id="_321" name="error" type="_112" offset="0" context="_114" access="public" location="f3:71" file="f3" line="71"/>
  <Field id="_322" name="pub_key" type="_374" offset="32" context="_114" access="public" location="f3:72" file="f3" line="72"/>
  <Field id="_323" name="num_common_caps" type="_112" offset="1328" context="_114" access="public" location="f3:73" file="f3" line="73"/>
  <Field id="_324" name="num_channel_caps" type="_112" offset="1360" context="_114" access="public" location="f3:74" file="f3" line="74"/>
  <Field id="_325" name="caps_offset" type="_112" offset="1392" context="_114" access="public" location="f3:75" file="f3" line="75"/>
  <Destructor id="_326" name="SpiceLinkReply" artificial="1" throw="" context="_114" access="public" mangled="_ZN14SpiceLinkReplyD1Ev *INTERNAL* " demangled="SpiceLinkReply::~SpiceLinkReply()" location="f3:70" file="f3" line="70" endline="70" inline="1">
  </Destructor>
  <OperatorMethod id="_327" name="=" returns="_375" artificial="1" throw="" context="_114" access="public" mangled="_ZN14SpiceLinkReplyaSERKS_" demangled="SpiceLinkReply::operator=(SpiceLinkReply const&amp;)" location="f3:70" file="f3" line="70" endline="70" inline="1">
    <Argument type="_376" location="f3:70" file="f3" line="70"/>
  </OperatorMethod>
  <Constructor id="_328" name="SpiceLinkReply" artificial="1" throw="" context="_114" access="public" mangled="_ZN14SpiceLinkReplyC1ERKS_ *INTERNAL* " demangled="SpiceLinkReply::SpiceLinkReply(SpiceLinkReply const&amp;)" location="f3:70" file="f3" line="70" endline="70" inline="1">
    <Argument type="_376" location="f3:70" file="f3" line="70"/>
  </Constructor>
  <Constructor id="_329" name="SpiceLinkReply" artificial="1" throw="" context="_114" access="public" mangled="_ZN14SpiceLinkReplyC1Ev *INTERNAL* " demangled="SpiceLinkReply::SpiceLinkReply()" location="f3:70" file="f3" line="70" inline="1"/>
  <Field id="_330" name="encrypted_data" type="_377" offset="0" context="_142" access="public" location="f3:79" file="f3" line="79"/>
  <Destructor id="_331" name="SpiceLinkEncryptedTicket" artificial="1" throw="" context="_142" access="public" mangled="_ZN24SpiceLinkEncryptedTicketD1Ev *INTERNAL* " demangled="SpiceLinkEncryptedTicket::~SpiceLinkEncryptedTicket()" location="f3:78" file="f3" line="78" endline="78" inline="1">
  </Destructor>
  <OperatorMethod id="_332" name="=" returns="_378" artificial="1" throw="" context="_142" access="public" mangled="_ZN24SpiceLinkEncryptedTicketaSERKS_" demangled="SpiceLinkEncryptedTicket::operator=(SpiceLinkEncryptedTicket const&amp;)" location="f3:78" file="f3" line="78" endline="78" inline="1">
    <Argument type="_379" location="f3:78" file="f3" line="78"/>
  </OperatorMethod>
  <Constructor id="_333" name="SpiceLinkEncryptedTicket" artificial="1" throw="" context="_142" access="public" mangled="_ZN24SpiceLinkEncryptedTicketC1ERKS_ *INTERNAL* " demangled="SpiceLinkEncryptedTicket::SpiceLinkEncryptedTicket(SpiceLinkEncryptedTicket const&amp;)" location="f3:78" file="f3" line="78" endline="78" inline="1">
    <Argument type="_379" location="f3:78" file="f3" line="78"/>
  </Constructor>
  <Constructor id="_334" name="SpiceLinkEncryptedTicket" artificial="1" throw="" context="_142" access="public" mangled="_ZN24SpiceLinkEncryptedTicketC1Ev *INTERNAL* " demangled="SpiceLinkEncryptedTicket::SpiceLinkEncryptedTicket()" location="f3:78" file="f3" line="78" inline="1"/>
  <Field id="_335" name="type" type="_202" offset="0" context="_222" access="public" location="f3:99" file="f3" line="99"/>
  <Field id="_336" name="size" type="_112" offset="16" context="_222" access="public" location="f3:100" file="f3" line="100"/>
  <Destructor id="_337" name="SpiceSubMessage" artificial="1" throw="" context="_222" access="public" mangled="_ZN15SpiceSubMessageD1Ev *INTERNAL* " demangled="SpiceSubMessage::~SpiceSubMessage()" location="f3:98" file="f3" line="98" endline="98" inline="1">
  </Destructor>
  <OperatorMethod id="_338" name="=" returns="_380" artificial="1" throw="" context="_222" access="public" mangled="_ZN15SpiceSubMessageaSERKS_" demangled="SpiceSubMessage::operator=(SpiceSubMessage const&amp;)" location="f3:98" file="f3" line="98" endline="98" inline="1">
    <Argument type="_381" location="f3:98" file="f3" line="98"/>
  </OperatorMethod>
  <Constructor id="_339" name="SpiceSubMessage" artificial="1" throw="" context="_222" access="public" mangled="_ZN15SpiceSubMessageC1ERKS_ *INTERNAL* " demangled="SpiceSubMessage::SpiceSubMessage(SpiceSubMessage const&amp;)" location="f3:98" file="f3" line="98" endline="98" inline="1">
    <Argument type="_381" location="f3:98" file="f3" line="98"/>
  </Constructor>
  <Constructor id="_340" name="SpiceSubMessage" artificial="1" throw="" context="_222" access="public" mangled="_ZN15SpiceSubMessageC1Ev *INTERNAL* " demangled="SpiceSubMessage::SpiceSubMessage()" location="f3:98" file="f3" line="98" inline="1"/>
  <Field id="_341" name="size" type="_202" offset="0" context="_230" access="public" location="f3:104" file="f3" line="104"/>
  <Field id="_342" name="sub_messages" type="_382" offset="16" context="_230" access="public" location="f3:105" file="f3" line="105"/>
  <Destructor id="_343" name="SpiceSubMessageList" artificial="1" throw="" context="_230" access="public" mangled="_ZN19SpiceSubMessageListD1Ev *INTERNAL* " demangled="SpiceSubMessageList::~SpiceSubMessageList()" location="f3:103" file="f3" line="103" endline="103" inline="1">
  </Destructor>
  <OperatorMethod id="_344" name="=" returns="_383" artificial="1" throw="" context="_230" access="public" mangled="_ZN19SpiceSubMessageListaSERKS_" demangled="SpiceSubMessageList::operator=(SpiceSubMessageList const&amp;)" location="f3:103" file="f3" line="103" endline="103" inline="1">
    <Argument type="_384" location="f3:103" file="f3" line="103"/>
  </OperatorMethod>
  <Constructor id="_345" name="SpiceSubMessageList" artificial="1" throw="" context="_230" access="public" mangled="_ZN19SpiceSubMessageListC1ERKS_ *INTERNAL* " demangled="SpiceSubMessageList::SpiceSubMessageList(SpiceSubMessageList const&amp;)" location="f3:103" file="f3" line="103" endline="103" inline="1">
    <Argument type="_384" location="f3:103" file="f3" line="103"/>
  </Constructor>
  <Constructor id="_346" name="SpiceSubMessageList" artificial="1" throw="" context="_230" access="public" mangled="_ZN19SpiceSubMessageListC1Ev *INTERNAL* " demangled="SpiceSubMessageList::SpiceSubMessageList()" location="f3:103" file="f3" line="103" inline="1"/>
  <Field id="_347" name="connection_id" type="_112" offset="0" context="_253" access="public" location="f3:62" file="f3" line="62"/>
  <Field id="_348" name="channel_type" type="_213" offset="32" context="_253" access="public" location="f3:63" file="f3" line="63"/>
  <Field id="_349" name="channel_id" type="_213" offset="40" context="_253" access="public" location="f3:64" file="f3" line="64"/>
  <Field id="_350" name="num_common_caps" type="_112" offset="48" context="_253" access="public" location="f3:65" file="f3" line="65"/>
  <Field id="_351" name="num_channel_caps" type="_112" offset="80" context="_253" access="public" location="f3:66" file="f3" line="66"/>
  <Field id="_352" name="caps_offset" type="_112" offset="112" context="_253" access="public" location="f3:67" file="f3" line="67"/>
  <Destructor id="_353" name="SpiceLinkMess" artificial="1" throw="" context="_253" access="public" mangled="_ZN13SpiceLinkMessD1Ev *INTERNAL* " demangled="SpiceLinkMess::~SpiceLinkMess()" location="f3:61" file="f3" line="61" endline="61" inline="1">
  </Destructor>
  <OperatorMethod id="_354" name="=" returns="_385" artificial="1" throw="" context="_253" access="public" mangled="_ZN13SpiceLinkMessaSERKS_" demangled="SpiceLinkMess::operator=(SpiceLinkMess const&amp;)" location="f3:61" file="f3" line="61" endline="61" inline="1">
    <Argument type="_386" location="f3:61" file="f3" line="61"/>
  </OperatorMethod>
  <Constructor id="_355" name="SpiceLinkMess" artificial="1" throw="" context="_253" access="public" mangled="_ZN13SpiceLinkMessC1ERKS_ *INTERNAL* " demangled="SpiceLinkMess::SpiceLinkMess(SpiceLinkMess const&amp;)" location="f3:61" file="f3" line="61" endline="61" inline="1">
    <Argument type="_386" location="f3:61" file="f3" line="61"/>
  </Constructor>
  <Constructor id="_356" name="SpiceLinkMess" artificial="1" throw="" context="_253" access="public" mangled="_ZN13SpiceLinkMessC1Ev *INTERNAL* " demangled="SpiceLinkMess::SpiceLinkMess()" location="f3:61" file="f3" line="61" inline="1"/>
  <Field id="_357" name="magic" type="_112" offset="0" context="_275" access="public" location="f3:48" file="f3" line="48"/>
  <Field id="_358" name="major_version" type="_112" offset="32" context="_275" access="public" location="f3:49" file="f3" line="49"/>
  <Field id="_359" name="minor_version" type="_112" offset="64" context="_275" access="public" location="f3:50" file="f3" line="50"/>
  <Field id="_360" name="size" type="_112" offset="96" context="_275" access="public" location="f3:51" file="f3" line="51"/>
  <Destructor id="_361" name="SpiceLinkHeader" artificial="1" throw="" context="_275" access="public" mangled="_ZN15SpiceLinkHeaderD1Ev *INTERNAL* " demangled="SpiceLinkHeader::~SpiceLinkHeader()" location="f3:47" file="f3" line="47" endline="47" inline="1">
  </Destructor>
  <OperatorMethod id="_362" name="=" returns="_387" artificial="1" throw="" context="_275" access="public" mangled="_ZN15SpiceLinkHeaderaSERKS_" demangled="SpiceLinkHeader::operator=(SpiceLinkHeader const&amp;)" location="f3:47" file="f3" line="47" endline="47" inline="1">
    <Argument type="_388" location="f3:47" file="f3" line="47"/>
  </OperatorMethod>
  <Constructor id="_363" name="SpiceLinkHeader" artificial="1" throw="" context="_275" access="public" mangled="_ZN15SpiceLinkHeaderC1ERKS_ *INTERNAL* " demangled="SpiceLinkHeader::SpiceLinkHeader(SpiceLinkHeader const&amp;)" location="f3:47" file="f3" line="47" endline="47" inline="1">
    <Argument type="_388" location="f3:47" file="f3" line="47"/>
  </Constructor>
  <Constructor id="_364" name="SpiceLinkHeader" artificial="1" throw="" context="_275" access="public" mangled="_ZN15SpiceLinkHeaderC1Ev *INTERNAL* " demangled="SpiceLinkHeader::SpiceLinkHeader()" location="f3:47" file="f3" line="47" inline="1"/>
  <ReferenceType id="_367" type="_44" size="64" align="64"/>
  <ReferenceType id="_368" type="_44c" size="64" align="64"/>
  <ReferenceType id="_369" type="_60" size="64" align="64"/>
  <ReferenceType id="_370" type="_60c" size="64" align="64"/>
  <ReferenceType id="_372" type="_87" size="64" align="64"/>
  <ReferenceType id="_373" type="_87c" size="64" align="64"/>
  <ArrayType id="_374" min="0" max="161u" type="_213" size="1296" align="8"/>
  <ReferenceType id="_375" type="_114" size="64" align="64"/>
  <ReferenceType id="_376" type="_114c" size="64" align="64"/>
  <ArrayType id="_377" min="0" max="127u" type="_213" size="1024" align="8"/>
  <ReferenceType id="_378" type="_142" size="64" align="64"/>
  <ReferenceType id="_379" type="_142c" size="64" align="64"/>
  <ReferenceType id="_380" type="_222" size="64" align="64"/>
  <ReferenceType id="_381" type="_222c" size="64" align="64"/>
  <ArrayType id="_382" min="0" max="0xffffffffffffffffffffffffffffffffu" type="_112" size="0" align="32"/>
  <ReferenceType id="_383" type="_230" size="64" align="64"/>
  <ReferenceType id="_384" type="_230c" size="64" align="64"/>
  <ReferenceType id="_385" type="_253" size="64" align="64"/>
  <ReferenceType id="_386" type="_253c" size="64" align="64"/>
  <ReferenceType id="_387" type="_275" size="64" align="64"/>
  <ReferenceType id="_388" type="_275c" size="64" align="64"/>
  <FundamentalType id="_365" name="char" size="8" align="8"/>
  <CvQualifiedType id="_365c" type="_365" const="1"/>
  <CvQualifiedType id="_309c" type="_309" const="1"/>
  <CvQualifiedType id="_275c" type="_275" const="1"/>
  <CvQualifiedType id="_253c" type="_253" const="1"/>
  <CvQualifiedType id="_114c" type="_114" const="1"/>
  <CvQualifiedType id="_142c" type="_142" const="1"/>
  <CvQualifiedType id="_60c" type="_60" const="1"/>
  <CvQualifiedType id="_44c" type="_44" const="1"/>
  <CvQualifiedType id="_87c" type="_87" const="1"/>
  <CvQualifiedType id="_222c" type="_222" const="1"/>
  <CvQualifiedType id="_230c" type="_230" const="1"/>
  <File id="f0" name="/usr/share/gccxml-0.9/GCC/4.6/gccxml_builtins.h"/>
  <File id="f1" name="/usr/include/stdint.h"/>
  <File id="f2" name="/home/n00b/Downloads/spice-protocol-0.10.1/spice/enums.h"/>
  <File id="f3" name="spice/protocol.h"/>
</GCC_XML>
