<?xml version="1.0"?>
<GCC_XML cvs_revision="1.135">

  <Function id="_379" name="__builtin_cosh" returns="_414" context="_1" mangled="cosh" location="f1:41" file="f1" line="41" extern="1" attributes="nothrow">
    <Argument type="_414" location="f1:41" file="f1" line="41"/>
  </Function>
  <Function id="_380" name="__builtin_cosl" returns="_417" context="_1" mangled="cosl" location="f1:44" file="f1" line="44" extern="1" attributes="nothrow pure no vops">
    <Argument type="_417" location="f1:44" file="f1" line="44"/>
  </Function>
  <Enumeration id="_381" name="SpiceMouseButton" context="_1" location="f3:254" file="f3" line="254" artificial="1" size="32" align="32">
    <EnumValue name="SPICE_MOUSE_BUTTON_INVALID" init="0"/>
    <EnumValue name="SPICE_MOUSE_BUTTON_LEFT" init="1"/>
    <EnumValue name="SPICE_MOUSE_BUTTON_MIDDLE" init="2"/>
    <EnumValue name="SPICE_MOUSE_BUTTON_RIGHT" init="3"/>
    <EnumValue name="SPICE_MOUSE_BUTTON_UP" init="4"/>
    <EnumValue name="SPICE_MOUSE_BUTTON_DOWN" init="5"/>
    <EnumValue name="SPICE_MOUSE_BUTTON_ENUM_END" init="6"/>
  </Enumeration>
  <Typedef id="_382" name="SpiceMouseButton" type="_381" context="_1" location="f3:263" file="f3" line="263"/>
  <Struct id="_383" name="QXLMessage" context="_1" mangled="10QXLMessage" demangled="QXLMessage" location="f0:266" file="f0" line="266" artificial="1" attributes="__packed__" size="64" align="8" members="_864 _865 _866 _867 _868 _869 " bases=""/>
  <Typedef id="_384" name="QXLMessage" type="_383" context="_1" location="f0:269" file="f0" line="269"/>
  <Enumeration id="_385" name="SpiceClipType" context="_1" location="f3:79" file="f3" line="79" artificial="1" size="32" align="32">
    <EnumValue name="SPICE_CLIP_TYPE_NONE" init="0"/>
    <EnumValue name="SPICE_CLIP_TYPE_RECTS" init="1"/>
    <EnumValue name="SPICE_CLIP_TYPE_ENUM_END" init="2"/>
  </Enumeration>
  <Typedef id="_386" name="SpiceClipType" type="_385" context="_1" location="f3:84" file="f3" line="84"/>
  <Function id="_387" name="__builtin_isgreater" returns="_418" context="_1" location="f1:137" file="f1" line="137" extern="1" attributes="nothrow const">
    <Ellipsis/>
  </Function>
  <Struct id="_388" name="QXLRam" context="_1" mangled="6QXLRam" demangled="QXLRam" location="f0:233" file="f0" line="233" artificial="1" attributes="__packed__" size="42720" align="8" members="_870 _871 _872 _873 _874 _875 _876 _877 _878 _879 _880 _881 _882 _883 _884 _885 " bases=""/>
  <Typedef id="_389" name="QXLRam" type="_388" context="_1" location="f0:247" file="f0" line="247"/>
  <Typedef id="_390" name="uint_least8_t" type="_295" context="_1" location="f2:77" file="f2" line="77"/>
  <Enumeration id="_391" name="SpiceMouseButtonMask" context="_1" location="f3:265" file="f3" line="265" artificial="1" size="32" align="32">
    <EnumValue name="SPICE_MOUSE_BUTTON_MASK_LEFT" init="1"/>
    <EnumValue name="SPICE_MOUSE_BUTTON_MASK_MIDDLE" init="2"/>
    <EnumValue name="SPICE_MOUSE_BUTTON_MASK_RIGHT" init="4"/>
    <EnumValue name="SPICE_MOUSE_BUTTON_MASK_MASK" init="7"/>
  </Enumeration>
  <Typedef id="_392" name="SpiceMouseButtonMask" type="_391" context="_1" location="f3:271" file="f3" line="271"/>
  <Struct id="_393" name="QXLLineAttr" context="_1" mangled="11QXLLineAttr" demangled="QXLLineAttr" location="f0:445" file="f0" line="445" artificial="1" attributes="__packed__" size="160" align="8" members="_886 _887 _888 _889 _890 _891 _892 _893 _894 _895 _896 " bases=""/>
  <Typedef id="_394" name="QXLLineAttr" type="_393" context="_1" location="f0:453" file="f0" line="453"/>
  <Enumeration id="_395" name="SpiceMouseMode" context="_1" location="f3:57" file="f3" line="57" artificial="1" size="32" align="32">
    <EnumValue name="SPICE_MOUSE_MODE_SERVER" init="1"/>
    <EnumValue name="SPICE_MOUSE_MODE_CLIENT" init="2"/>
    <EnumValue name="SPICE_MOUSE_MODE_MASK" init="3"/>
  </Enumeration>
  <Typedef id="_396" name="SpiceMouseMode" type="_395" context="_1" location="f3:62" file="f3" line="62"/>
  <Function id="_397" name="__builtin_sinf" returns="_416" context="_1" mangled="sinf" location="f1:76" file="f1" line="76" extern="1" attributes="nothrow pure no vops">
    <Argument type="_416" location="f1:76" file="f1" line="76"/>
  </Function>
  <Function id="_398" name="__builtin_sinh" returns="_414" context="_1" mangled="sinh" location="f1:77" file="f1" line="77" extern="1" attributes="nothrow">
    <Argument type="_414" location="f1:77" file="f1" line="77"/>
  </Function>
  <Function id="_399" name="__builtin_sinl" returns="_417" context="_1" mangled="sinl" location="f1:80" file="f1" line="80" extern="1" attributes="nothrow pure no vops">
    <Argument type="_417" location="f1:80" file="f1" line="80"/>
  </Function>
  <Typedef id="_400" name="uint64_t" type="_11" context="_1" location="f2:56" file="f2" line="56"/>
  <Function id="_401" name="__builtin_csin" returns="_436" context="_1" mangled="csin" location="f1:115" file="f1" line="115" extern="1" attributes="nothrow pure no vops">
    <Argument type="_436" location="f1:115" file="f1" line="115"/>
  </Function>
  <Struct id="_402" name="QXLRop3" context="_1" mangled="7QXLRop3" demangled="QXLRop3" location="f0:436" file="f0" line="436" artificial="1" attributes="__packed__" size="504" align="8" members="_897 _898 _899 _900 _901 _902 _903 _904 _905 _906 " bases=""/>
  <Typedef id="_403" name="QXLRop3" type="_402" context="_1" location="f0:443" file="f0" line="443"/>
  <Struct id="_404" name="QXLQMask" context="_1" mangled="8QXLQMask" demangled="QXLQMask" location="f0:387" file="f0" line="387" artificial="1" attributes="__packed__" size="136" align="8" members="_907 _908 _909 _910 _911 _912 _913 " bases=""/>
  <Typedef id="_405" name="QXLQMask" type="_404" context="_1" location="f0:391" file="f0" line="391"/>
  <Struct id="_406" name="QXLText" context="_1" mangled="7QXLText" demangled="QXLText" location="f0:463" file="f0" line="463" artificial="1" attributes="__packed__" size="544" align="8" members="_914 _915 _916 _917 _918 _919 _920 _921 _922 _923 " bases=""/>
  <Typedef id="_407" name="QXLText" type="_406" context="_1" location="f0:470" file="f0" line="470"/>
  <Field id="_408" name="mem_start" type="_400" offset="0" context="_3" access="public" location="f0:196" file="f0" line="196"/>
  <Field id="_409" name="mem_end" type="_400" offset="64" context="_3" access="public" location="f0:197" file="f0" line="197"/>
  <Destructor id="_410" name="QXLMemSlot" artificial="1" throw="" context="_3" access="public" mangled="_ZN10QXLMemSlotD1Ev *INTERNAL* " demangled="QXLMemSlot::~QXLMemSlot()" location="f0:195" file="f0" line="195" endline="195" inline="1">
  </Destructor>
  <OperatorMethod id="_411" name="=" returns="_924" artificial="1" throw="" context="_3" access="public" mangled="_ZN10QXLMemSlotaSERKS_" demangled="QXLMemSlot::operator=(QXLMemSlot const&amp;)" location="f0:195" file="f0" line="195" endline="195" inline="1">
    <Argument type="_925" location="f0:195" file="f0" line="195"/>
  </OperatorMethod>
  <Constructor id="_412" name="QXLMemSlot" artificial="1" throw="" context="_3" access="public" mangled="_ZN10QXLMemSlotC1ERKS_ *INTERNAL* " demangled="QXLMemSlot::QXLMemSlot(QXLMemSlot const&amp;)" location="f0:195" file="f0" line="195" endline="195" inline="1">
    <Argument type="_925" location="f0:195" file="f0" line="195"/>
  </Constructor>
  <Constructor id="_413" name="QXLMemSlot" artificial="1" throw="" context="_3" access="public" mangled="_ZN10QXLMemSlotC1Ev *INTERNAL* " demangled="QXLMemSlot::QXLMemSlot()" location="f0:195" file="f0" line="195" inline="1"/>
  <FundamentalType id="_414" name="double" size="64" align="64"/>
  <PointerType id="_415" type="_926c" size="64" align="64"/>
  <FundamentalType id="_416" name="float" size="32" align="32"/>
  <FundamentalType id="_417" name="long double" size="128" align="128"/>
  <FundamentalType id="_418" name="bool" size="8" align="8"/>
  <FundamentalType id="_419" name="long long int" size="64" align="64"/>
  <FundamentalType id="_420" name="complex float" size="64" align="32"/>
  <FundamentalType id="_421" name="complex long double" size="256" align="128"/>
  <Field id="_422" name="release_info" type="_57" offset="0" context="_21" access="public" location="f0:278" file="f0" line="278"/>
  <Field id="_423" name="area" type="_87" offset="64" context="_21" access="public" location="f0:279" file="f0" line="279"/>
  <Field id="_424" name="update_id" type="_149" offset="192" context="_21" access="public" location="f0:280" file="f0" line="280"/>
  <Field id="_425" name="surface_id" type="_149" offset="224" context="_21" access="public" location="f0:281" file="f0" line="281"/>
  <Destructor id="_426" name="QXLUpdateCmd" artificial="1" throw="" context="_21" access="public" mangled="_ZN12QXLUpdateCmdD1Ev *INTERNAL* " demangled="QXLUpdateCmd::~QXLUpdateCmd()" location="f0:277" file="f0" line="277" endline="277" inline="1">
  </Destructor>
  <OperatorMethod id="_427" name="=" returns="_928" artificial="1" throw="" context="_21" access="public" mangled="_ZN12QXLUpdateCmdaSERKS_" demangled="QXLUpdateCmd::operator=(QXLUpdateCmd const&amp;)" location="f0:277" file="f0" line="277" endline="277" inline="1">
    <Argument type="_929" location="f0:277" file="f0" line="277"/>
  </OperatorMethod>
  <Constructor id="_428" name="QXLUpdateCmd" artificial="1" throw="" context="_21" access="public" mangled="_ZN12QXLUpdateCmdC1ERKS_ *INTERNAL* " demangled="QXLUpdateCmd::QXLUpdateCmd(QXLUpdateCmd const&amp;)" location="f0:277" file="f0" line="277" endline="277" inline="1">
    <Argument type="_929" location="f0:277" file="f0" line="277"/>
  </Constructor>
  <Constructor id="_429" name="QXLUpdateCmd" artificial="1" throw="" context="_21" access="public" mangled="_ZN12QXLUpdateCmdC1Ev *INTERNAL* " demangled="QXLUpdateCmd::QXLUpdateCmd()" location="f0:277" file="f0" line="277" inline="1"/>
  <Field id="_430" name="data_size" type="_149" offset="0" context="_23" access="public" location="f0:643" file="f0" line="643"/>
  <Field id="_431" name="data" type="_930" offset="32" context="_23" access="public" location="f0:644" file="f0" line="644"/>
  <Destructor id="_432" name="QXLQUICData" artificial="1" throw="" context="_23" access="public" mangled="_ZN11QXLQUICDataD1Ev *INTERNAL* " demangled="QXLQUICData::~QXLQUICData()" location="f0:642" file="f0" line="642" endline="642" inline="1">
  </Destructor>
  <OperatorMethod id="_433" name="=" returns="_931" artificial="1" throw="" context="_23" access="public" mangled="_ZN11QXLQUICDataaSERKS_" demangled="QXLQUICData::operator=(QXLQUICData const&amp;)" location="f0:642" file="f0" line="642" endline="642" inline="1">
    <Argument type="_932" location="f0:642" file="f0" line="642"/>
  </OperatorMethod>
  <Constructor id="_434" name="QXLQUICData" artificial="1" throw="" context="_23" access="public" mangled="_ZN11QXLQUICDataC1ERKS_ *INTERNAL* " demangled="QXLQUICData::QXLQUICData(QXLQUICData const&amp;)" location="f0:642" file="f0" line="642" endline="642" inline="1">
    <Argument type="_932" location="f0:642" file="f0" line="642"/>
  </Constructor>
  <Constructor id="_435" name="QXLQUICData" artificial="1" throw="" context="_23" access="public" mangled="_ZN11QXLQUICDataC1Ev *INTERNAL* " demangled="QXLQUICData::QXLQUICData()" location="f0:642" file="f0" line="642" inline="1"/>
  <FundamentalType id="_436" name="complex double" size="128" align="64"/>
  <Field id="_437" name="descriptor" type="_262" offset="0" context="_50" access="public" location="f0:648" file="f0" line="648"/>
  <Field id="_438" name="" type="_439" offset="144" context="_50" access="public" location="f0:653" file="f0" line="653"/>
  <Union id="_439" context="_50" access="public" mangled="N8QXLImage4._37E" demangled="QXLImage::._37" location="f0:649" file="f0" line="649" artificial="1" size="240" align="8" members="_933 _934 _935 " bases=""/>
  <Destructor id="_440" name="QXLImage" artificial="1" throw="" context="_50" access="public" mangled="_ZN8QXLImageD1Ev *INTERNAL* " demangled="QXLImage::~QXLImage()" location="f0:647" file="f0" line="647" endline="647" inline="1">
  </Destructor>
  <OperatorMethod id="_441" name="=" returns="_936" artificial="1" throw="" context="_50" access="public" mangled="_ZN8QXLImageaSERKS_" demangled="QXLImage::operator=(QXLImage const&amp;)" location="f0:647" file="f0" line="647" endline="647" inline="1">
    <Argument type="_937" location="f0:647" file="f0" line="647"/>
  </OperatorMethod>
  <Constructor id="_442" name="QXLImage" artificial="1" throw="" context="_50" access="public" mangled="_ZN8QXLImageC1ERKS_ *INTERNAL* " demangled="QXLImage::QXLImage(QXLImage const&amp;)" location="f0:647" file="f0" line="647" endline="647" inline="1">
    <Argument type="_937" location="f0:647" file="f0" line="647"/>
  </Constructor>
  <Constructor id="_443" name="QXLImage" artificial="1" throw="" context="_50" access="public" mangled="_ZN8QXLImageC1Ev *INTERNAL* " demangled="QXLImage::QXLImage()" location="f0:647" file="f0" line="647" inline="1"/>
  <Field id="_444" name="id" type="_400" offset="0" context="_56" access="public" location="f0:250" file="f0" line="250"/>
  <Field id="_445" name="next" type="_400" offset="0" context="_56" access="public" location="f0:251" file="f0" line="251"/>
  <Destructor id="_446" name="QXLReleaseInfo" artificial="1" throw="" context="_56" access="public" mangled="_ZN14QXLReleaseInfoD1Ev *INTERNAL* " demangled="QXLReleaseInfo::~QXLReleaseInfo()" location="f0:249" file="f0" line="249" endline="249" inline="1">
  </Destructor>
  <OperatorMethod id="_447" name="=" returns="_938" artificial="1" throw="" context="_56" access="public" mangled="_ZN14QXLReleaseInfoaSERKS_" demangled="QXLReleaseInfo::operator=(QXLReleaseInfo const&amp;)" location="f0:249" file="f0" line="249" endline="249" inline="1">
    <Argument type="_939" location="f0:249" file="f0" line="249"/>
  </OperatorMethod>
  <Constructor id="_448" name="QXLReleaseInfo" artificial="1" throw="" context="_56" access="public" mangled="_ZN14QXLReleaseInfoC1ERKS_ *INTERNAL* " demangled="QXLReleaseInfo::QXLReleaseInfo(QXLReleaseInfo const&amp;)" location="f0:249" file="f0" line="249" endline="249" inline="1">
    <Argument type="_939" location="f0:249" file="f0" line="249"/>
  </Constructor>
  <Constructor id="_449" name="QXLReleaseInfo" artificial="1" throw="" context="_56" access="public" mangled="_ZN14QXLReleaseInfoC1Ev *INTERNAL* " demangled="QXLReleaseInfo::QXLReleaseInfo()" location="f0:249" file="f0" line="249" inline="1"/>
  <Field id="_450" name="id" type="_149" offset="0" context="_70" access="public" location="f0:153" file="f0" line="153"/>
  <Field id="_451" name="x_res" type="_149" offset="32" context="_70" access="public" location="f0:154" file="f0" line="154"/>
  <Field id="_452" name="y_res" type="_149" offset="64" context="_70" access="public" location="f0:155" file="f0" line="155"/>
  <Field id="_453" name="bits" type="_149" offset="96" context="_70" access="public" location="f0:156" file="f0" line="156"/>
  <Field id="_454" name="stride" type="_149" offset="128" context="_70" access="public" location="f0:157" file="f0" line="157"/>
  <Field id="_455" name="x_mili" type="_149" offset="160" context="_70" access="public" location="f0:158" file="f0" line="158"/>
  <Field id="_456" name="y_mili" type="_149" offset="192" context="_70" access="public" location="f0:159" file="f0" line="159"/>
  <Field id="_457" name="orientation" type="_149" offset="224" context="_70" access="public" location="f0:160" file="f0" line="160"/>
  <Destructor id="_458" name="QXLMode" artificial="1" throw="" context="_70" access="public" mangled="_ZN7QXLModeD1Ev *INTERNAL* " demangled="QXLMode::~QXLMode()" location="f0:152" file="f0" line="152" endline="152" inline="1">
  </Destructor>
  <OperatorMethod id="_459" name="=" returns="_940" artificial="1" throw="" context="_70" access="public" mangled="_ZN7QXLModeaSERKS_" demangled="QXLMode::operator=(QXLMode const&amp;)" location="f0:152" file="f0" line="152" endline="152" inline="1">
    <Argument type="_941" location="f0:152" file="f0" line="152"/>
  </OperatorMethod>
  <Constructor id="_460" name="QXLMode" artificial="1" throw="" context="_70" access="public" mangled="_ZN7QXLModeC1ERKS_ *INTERNAL* " demangled="QXLMode::QXLMode(QXLMode const&amp;)" location="f0:152" file="f0" line="152" endline="152" inline="1">
    <Argument type="_941" location="f0:152" file="f0" line="152"/>
  </Constructor>
  <Constructor id="_461" name="QXLMode" artificial="1" throw="" context="_70" access="public" mangled="_ZN7QXLModeC1Ev *INTERNAL* " demangled="QXLMode::QXLMode()" location="f0:152" file="f0" line="152" inline="1"/>
  <FundamentalType id="_462" name="void" align="8"/>
  <PointerType id="_463" type="_462" size="64" align="64"/>
  <Field id="_464" name="flags" type="_149" offset="0" context="_77" access="public" location="f0:572" file="f0" line="572"/>
  <Field id="_465" name="count" type="_149" offset="32" context="_77" access="public" location="f0:573" file="f0" line="573"/>
  <Field id="_466" name="points" type="_942" offset="64" context="_77" access="public" location="f0:574" file="f0" line="574"/>
  <Destructor id="_467" name="QXLPathSeg" artificial="1" throw="" context="_77" access="public" mangled="_ZN10QXLPathSegD1Ev *INTERNAL* " demangled="QXLPathSeg::~QXLPathSeg()" location="f0:571" file="f0" line="571" endline="571" inline="1">
  </Destructor>
  <OperatorMethod id="_468" name="=" returns="_943" artificial="1" throw="" context="_77" access="public" mangled="_ZN10QXLPathSegaSERKS_" demangled="QXLPathSeg::operator=(QXLPathSeg const&amp;)" location="f0:571" file="f0" line="571" endline="571" inline="1">
    <Argument type="_944" location="f0:571" file="f0" line="571"/>
  </OperatorMethod>
  <Constructor id="_469" name="QXLPathSeg" artificial="1" throw="" context="_77" access="public" mangled="_ZN10QXLPathSegC1ERKS_ *INTERNAL* " demangled="QXLPathSeg::QXLPathSeg(QXLPathSeg const&amp;)" location="f0:571" file="f0" line="571" endline="571" inline="1">
    <Argument type="_944" location="f0:571" file="f0" line="571"/>
  </Constructor>
  <Constructor id="_470" name="QXLPathSeg" artificial="1" throw="" context="_77" access="public" mangled="_ZN10QXLPathSegC1Ev *INTERNAL* " demangled="QXLPathSeg::QXLPathSeg()" location="f0:571" file="f0" line="571" inline="1"/>
  <Field id="_471" name="top" type="_276" offset="0" context="_86" access="public" location="f0:119" file="f0" line="119"/>
  <Field id="_472" name="left" type="_276" offset="32" context="_86" access="public" location="f0:120" file="f0" line="120"/>
  <Field id="_473" name="bottom" type="_276" offset="64" context="_86" access="public" location="f0:121" file="f0" line="121"/>
  <Field id="_474" name="right" type="_276" offset="96" context="_86" access="public" location="f0:122" file="f0" line="122"/>
  <Destructor id="_475" name="QXLRect" artificial="1" throw="" context="_86" access="public" mangled="_ZN7QXLRectD1Ev *INTERNAL* " demangled="QXLRect::~QXLRect()" location="f0:118" file="f0" line="118" endline="118" inline="1">
  </Destructor>
  <OperatorMethod id="_476" name="=" returns="_945" artificial="1" throw="" context="_86" access="public" mangled="_ZN7QXLRectaSERKS_" demangled="QXLRect::operator=(QXLRect const&amp;)" location="f0:118" file="f0" line="118" endline="118" inline="1">
    <Argument type="_946" location="f0:118" file="f0" line="118"/>
  </OperatorMethod>
  <Constructor id="_477" name="QXLRect" artificial="1" throw="" context="_86" access="public" mangled="_ZN7QXLRectC1ERKS_ *INTERNAL* " demangled="QXLRect::QXLRect(QXLRect const&amp;)" location="f0:118" file="f0" line="118" endline="118" inline="1">
    <Argument type="_946" location="f0:118" file="f0" line="118"/>
  </Constructor>
  <Constructor id="_478" name="QXLRect" artificial="1" throw="" context="_86" access="public" mangled="_ZN7QXLRectC1Ev *INTERNAL* " demangled="QXLRect::QXLRect()" location="f0:118" file="f0" line="118" inline="1"/>
  <PointerType id="_479" type="_462c" size="64" align="64"/>
  <Field id="_480" name="" type="_481" offset="0" context="_99" access="public" location="f0:221" file="f0" line="221"/>
  <Union id="_481" context="_99" access="public" mangled="N21QXLCursorRing_ring_el4._23E" demangled="QXLCursorRing_ring_el::._23" location="f0:221" file="f0" line="221" artificial="1" size="128" align="8" members="_948 _949 " bases=""/>
  <Destructor id="_482" name="QXLCursorRing_ring_el" artificial="1" throw="" context="_99" access="public" mangled="_ZN21QXLCursorRing_ring_elD1Ev *INTERNAL* " demangled="QXLCursorRing_ring_el::~QXLCursorRing_ring_el()" location="f0:221" file="f0" line="221" endline="221" inline="1">
  </Destructor>
  <OperatorMethod id="_483" name="=" returns="_950" artificial="1" throw="" context="_99" access="public" mangled="_ZN21QXLCursorRing_ring_elaSERKS_" demangled="QXLCursorRing_ring_el::operator=(QXLCursorRing_ring_el const&amp;)" location="f0:221" file="f0" line="221" endline="221" inline="1">
    <Argument type="_951" location="f0:221" file="f0" line="221"/>
  </OperatorMethod>
  <Constructor id="_484" name="QXLCursorRing_ring_el" artificial="1" throw="" context="_99" access="public" mangled="_ZN21QXLCursorRing_ring_elC1ERKS_ *INTERNAL* " demangled="QXLCursorRing_ring_el::QXLCursorRing_ring_el(QXLCursorRing_ring_el const&amp;)" location="f0:221" file="f0" line="221" endline="221" inline="1">
    <Argument type="_951" location="f0:221" file="f0" line="221"/>
  </Constructor>
  <Constructor id="_485" name="QXLCursorRing_ring_el" artificial="1" throw="" context="_99" access="public" mangled="_ZN21QXLCursorRing_ring_elC1Ev *INTERNAL* " demangled="QXLCursorRing_ring_el::QXLCursorRing_ring_el()" location="f0:221" file="f0" line="221" inline="1"/>
  <Field id="_486" name="" type="_487" offset="0" context="_103" access="public" location="f0:220" file="f0" line="220"/>
  <Union id="_487" context="_103" access="public" mangled="N22QXLCommandRing_ring_el4._22E" demangled="QXLCommandRing_ring_el::._22" location="f0:220" file="f0" line="220" artificial="1" size="128" align="8" members="_952 _953 " bases=""/>
  <Destructor id="_488" name="QXLCommandRing_ring_el" artificial="1" throw="" context="_103" access="public" mangled="_ZN22QXLCommandRing_ring_elD1Ev *INTERNAL* " demangled="QXLCommandRing_ring_el::~QXLCommandRing_ring_el()" location="f0:220" file="f0" line="220" endline="220" inline="1">
  </Destructor>
  <OperatorMethod id="_489" name="=" returns="_954" artificial="1" throw="" context="_103" access="public" mangled="_ZN22QXLCommandRing_ring_elaSERKS_" demangled="QXLCommandRing_ring_el::operator=(QXLCommandRing_ring_el const&amp;)" location="f0:220" file="f0" line="220" endline="220" inline="1">
    <Argument type="_955" location="f0:220" file="f0" line="220"/>
  </OperatorMethod>
  <Constructor id="_490" name="QXLCommandRing_ring_el" artificial="1" throw="" context="_103" access="public" mangled="_ZN22QXLCommandRing_ring_elC1ERKS_ *INTERNAL* " demangled="QXLCommandRing_ring_el::QXLCommandRing_ring_el(QXLCommandRing_ring_el const&amp;)" location="f0:220" file="f0" line="220" endline="220" inline="1">
    <Argument type="_955" location="f0:220" file="f0" line="220"/>
  </Constructor>
  <Constructor id="_491" name="QXLCommandRing_ring_el" artificial="1" throw="" context="_103" access="public" mangled="_ZN22QXLCommandRing_ring_elC1Ev *INTERNAL* " demangled="QXLCommandRing_ring_el::QXLCommandRing_ring_el()" location="f0:220" file="f0" line="220" inline="1"/>
  <Field id="_492" name="num_items" type="_149" offset="0" context="_105" access="public" location="f0:221" file="f0" line="221"/>
  <Field id="_493" name="prod" type="_149" offset="32" context="_105" access="public" location="f0:221" file="f0" line="221"/>
  <Field id="_494" name="notify_on_prod" type="_149" offset="64" context="_105" access="public" location="f0:221" file="f0" line="221"/>
  <Field id="_495" name="cons" type="_149" offset="96" context="_105" access="public" location="f0:221" file="f0" line="221"/>
  <Field id="_496" name="notify_on_cons" type="_149" offset="128" context="_105" access="public" location="f0:221" file="f0" line="221"/>
  <Field id="_497" name="items" type="_956" offset="160" context="_105" access="public" location="f0:221" file="f0" line="221"/>
  <Destructor id="_498" name="QXLCursorRing" artificial="1" throw="" context="_105" access="public" mangled="_ZN13QXLCursorRingD1Ev *INTERNAL* " demangled="QXLCursorRing::~QXLCursorRing()" location="f0:221" file="f0" line="221" endline="221" inline="1">
  </Destructor>
  <OperatorMethod id="_499" name="=" returns="_957" artificial="1" throw="" context="_105" access="public" mangled="_ZN13QXLCursorRingaSERKS_" demangled="QXLCursorRing::operator=(QXLCursorRing const&amp;)" location="f0:221" file="f0" line="221" endline="221" inline="1">
    <Argument type="_958" location="f0:221" file="f0" line="221"/>
  </OperatorMethod>
  <Constructor id="_500" name="QXLCursorRing" artificial="1" throw="" context="_105" access="public" mangled="_ZN13QXLCursorRingC1ERKS_ *INTERNAL* " demangled="QXLCursorRing::QXLCursorRing(QXLCursorRing const&amp;)" location="f0:221" file="f0" line="221" endline="221" inline="1">
    <Argument type="_958" location="f0:221" file="f0" line="221"/>
  </Constructor>
  <Constructor id="_501" name="QXLCursorRing" artificial="1" throw="" context="_105" access="public" mangled="_ZN13QXLCursorRingC1Ev *INTERNAL* " demangled="QXLCursorRing::QXLCursorRing()" location="f0:221" file="f0" line="221" inline="1"/>
  <Field id="_502" name="magic" type="_149" offset="0" context="_110" access="public" location="f0:127" file="f0" line="127"/>
  <Field id="_503" name="id" type="_149" offset="32" context="_110" access="public" location="f0:128" file="f0" line="128"/>
  <Field id="_504" name="update_id" type="_149" offset="64" context="_110" access="public" location="f0:129" file="f0" line="129"/>
  <Field id="_505" name="compression_level" type="_149" offset="96" context="_110" access="public" location="f0:130" file="f0" line="130"/>
  <Field id="_506" name="log_level" type="_149" offset="128" context="_110" access="public" location="f0:131" file="f0" line="131"/>
  <Field id="_507" name="mode" type="_149" offset="160" context="_110" access="public" location="f0:132" file="f0" line="132"/>
  <Field id="_508" name="modes_offset" type="_149" offset="192" context="_110" access="public" location="f0:133" file="f0" line="133"/>
  <Field id="_509" name="num_pages" type="_149" offset="224" context="_110" access="public" location="f0:134" file="f0" line="134"/>
  <Field id="_510" name="pages_offset" type="_149" offset="256" context="_110" access="public" location="f0:135" file="f0" line="135"/>
  <Field id="_511" name="draw_area_offset" type="_149" offset="288" context="_110" access="public" location="f0:136" file="f0" line="136"/>
  <Field id="_512" name="surface0_area_size" type="_149" offset="320" context="_110" access="public" location="f0:137" file="f0" line="137"/>
  <Field id="_513" name="ram_header_offset" type="_149" offset="352" context="_110" access="public" location="f0:138" file="f0" line="138"/>
  <Field id="_514" name="mm_clock" type="_149" offset="384" context="_110" access="public" location="f0:139" file="f0" line="139"/>
  <Field id="_515" name="n_surfaces" type="_149" offset="416" context="_110" access="public" location="f0:141" file="f0" line="141"/>
  <Field id="_516" name="flags" type="_400" offset="448" context="_110" access="public" location="f0:142" file="f0" line="142"/>
  <Field id="_517" name="slots_start" type="_307" offset="512" context="_110" access="public" location="f0:143" file="f0" line="143"/>
  <Field id="_518" name="slots_end" type="_307" offset="520" context="_110" access="public" location="f0:144" file="f0" line="144"/>
  <Field id="_519" name="slot_gen_bits" type="_307" offset="528" context="_110" access="public" location="f0:145" file="f0" line="145"/>
  <Field id="_520" name="slot_id_bits" type="_307" offset="536" context="_110" access="public" location="f0:146" file="f0" line="146"/>
  <Field id="_521" name="slot_generation" type="_307" offset="544" context="_110" access="public" location="f0:147" file="f0" line="147"/>
  <Field id="_522" name="padding" type="_959" offset="552" context="_110" access="public" location="f0:148" file="f0" line="148"/>
  <Destructor id="_523" name="QXLRom" artificial="1" throw="" context="_110" access="public" mangled="_ZN6QXLRomD1Ev *INTERNAL* " demangled="QXLRom::~QXLRom()" location="f0:126" file="f0" line="126" endline="126" inline="1">
  </Destructor>
  <OperatorMethod id="_524" name="=" returns="_960" artificial="1" throw="" context="_110" access="public" mangled="_ZN6QXLRomaSERKS_" demangled="QXLRom::operator=(QXLRom const&amp;)" location="f0:126" file="f0" line="126" endline="126" inline="1">
    <Argument type="_961" location="f0:126" file="f0" line="126"/>
  </OperatorMethod>
  <Constructor id="_525" name="QXLRom" artificial="1" throw="" context="_110" access="public" mangled="_ZN6QXLRomC1ERKS_ *INTERNAL* " demangled="QXLRom::QXLRom(QXLRom const&amp;)" location="f0:126" file="f0" line="126" endline="126" inline="1">
    <Argument type="_961" location="f0:126" file="f0" line="126"/>
  </Constructor>
  <Constructor id="_526" name="QXLRom" artificial="1" throw="" context="_110" access="public" mangled="_ZN6QXLRomC1Ev *INTERNAL* " demangled="QXLRom::QXLRom()" location="f0:126" file="f0" line="126" inline="1"/>
  <PointerType id="_527" type="_88" size="64" align="64"/>
  <Field id="_528" name="path" type="_237" offset="0" context="_115" access="public" location="f0:456" file="f0" line="456"/>
  <Field id="_529" name="attr" type="_394" offset="64" context="_115" access="public" location="f0:457" file="f0" line="457"/>
  <Field id="_530" name="brush" type="_375" offset="224" context="_115" access="public" location="f0:458" file="f0" line="458"/>
  <Field id="_531" name="fore_mode" type="_288" offset="384" context="_115" access="public" location="f0:459" file="f0" line="459"/>
  <Field id="_532" name="back_mode" type="_288" offset="400" context="_115" access="public" location="f0:460" file="f0" line="460"/>
  <Destructor id="_533" name="QXLStroke" artificial="1" throw="" context="_115" access="public" mangled="_ZN9QXLStrokeD1Ev *INTERNAL* " demangled="QXLStroke::~QXLStroke()" location="f0:455" file="f0" line="455" endline="455" inline="1">
  </Destructor>
  <OperatorMethod id="_534" name="=" returns="_962" artificial="1" throw="" context="_115" access="public" mangled="_ZN9QXLStrokeaSERKS_" demangled="QXLStroke::operator=(QXLStroke const&amp;)" location="f0:455" file="f0" line="455" endline="455" inline="1">
    <Argument type="_963" location="f0:455" file="f0" line="455"/>
  </OperatorMethod>
  <Constructor id="_535" name="QXLStroke" artificial="1" throw="" context="_115" access="public" mangled="_ZN9QXLStrokeC1ERKS_ *INTERNAL* " demangled="QXLStroke::QXLStroke(QXLStroke const&amp;)" location="f0:455" file="f0" line="455" endline="455" inline="1">
    <Argument type="_963" location="f0:455" file="f0" line="455"/>
  </Constructor>
  <Constructor id="_536" name="QXLStroke" artificial="1" throw="" context="_115" access="public" mangled="_ZN9QXLStrokeC1Ev *INTERNAL* " demangled="QXLStroke::QXLStroke()" location="f0:455" file="f0" line="455" inline="1"/>
  <Field id="_537" name="x" type="_182" offset="0" context="_124" access="public" location="f0:114" file="f0" line="114"/>
  <Field id="_538" name="y" type="_182" offset="16" context="_124" access="public" location="f0:115" file="f0" line="115"/>
  <Destructor id="_539" name="QXLPoint16" artificial="1" throw="" context="_124" access="public" mangled="_ZN10QXLPoint16D1Ev *INTERNAL* " demangled="QXLPoint16::~QXLPoint16()" location="f0:113" file="f0" line="113" endline="113" inline="1">
  </Destructor>
  <OperatorMethod id="_540" name="=" returns="_964" artificial="1" throw="" context="_124" access="public" mangled="_ZN10QXLPoint16aSERKS_" demangled="QXLPoint16::operator=(QXLPoint16 const&amp;)" location="f0:113" file="f0" line="113" endline="113" inline="1">
    <Argument type="_965" location="f0:113" file="f0" line="113"/>
  </OperatorMethod>
  <Constructor id="_541" name="QXLPoint16" artificial="1" throw="" context="_124" access="public" mangled="_ZN10QXLPoint16C1ERKS_ *INTERNAL* " demangled="QXLPoint16::QXLPoint16(QXLPoint16 const&amp;)" location="f0:113" file="f0" line="113" endline="113" inline="1">
    <Argument type="_965" location="f0:113" file="f0" line="113"/>
  </Constructor>
  <Constructor id="_542" name="QXLPoint16" artificial="1" throw="" context="_124" access="public" mangled="_ZN10QXLPoint16C1Ev *INTERNAL* " demangled="QXLPoint16::QXLPoint16()" location="f0:113" file="f0" line="113" inline="1"/>
  <Field id="_543" name="data_size" type="_149" offset="0" context="_128" access="public" location="f0:260" file="f0" line="260"/>
  <Field id="_544" name="prev_chunk" type="_237" offset="32" context="_128" access="public" location="f0:261" file="f0" line="261"/>
  <Field id="_545" name="next_chunk" type="_237" offset="96" context="_128" access="public" location="f0:262" file="f0" line="262"/>
  <Field id="_546" name="data" type="_966" offset="160" context="_128" access="public" location="f0:263" file="f0" line="263"/>
  <Destructor id="_547" name="QXLDataChunk" artificial="1" throw="" context="_128" access="public" mangled="_ZN12QXLDataChunkD1Ev *INTERNAL* " demangled="QXLDataChunk::~QXLDataChunk()" location="f0:259" file="f0" line="259" endline="259" inline="1">
  </Destructor>
  <OperatorMethod id="_548" name="=" returns="_967" artificial="1" throw="" context="_128" access="public" mangled="_ZN12QXLDataChunkaSERKS_" demangled="QXLDataChunk::operator=(QXLDataChunk const&amp;)" location="f0:259" file="f0" line="259" endline="259" inline="1">
    <Argument type="_968" location="f0:259" file="f0" line="259"/>
  </OperatorMethod>
  <Constructor id="_549" name="QXLDataChunk" artificial="1" throw="" context="_128" access="public" mangled="_ZN12QXLDataChunkC1ERKS_ *INTERNAL* " demangled="QXLDataChunk::QXLDataChunk(QXLDataChunk const&amp;)" location="f0:259" file="f0" line="259" endline="259" inline="1">
    <Argument type="_968" location="f0:259" file="f0" line="259"/>
  </Constructor>
  <Constructor id="_550" name="QXLDataChunk" artificial="1" throw="" context="_128" access="public" mangled="_ZN12QXLDataChunkC1Ev *INTERNAL* " demangled="QXLDataChunk::QXLDataChunk()" location="f0:259" file="f0" line="259" inline="1"/>
  <Field id="_551" name="release_info" type="_57" offset="0" context="_131" access="public" location="f0:309" file="f0" line="309"/>
  <Field id="_552" name="type" type="_307" offset="64" context="_131" access="public" location="f0:310" file="f0" line="310"/>
  <Field id="_553" name="u" type="_555" offset="72" context="_131" access="public" location="f0:322" file="f0" line="322"/>
  <Field id="_554" name="device_data" type="_969" offset="176" context="_131" access="public" location="f0:323" file="f0" line="323"/>
  <Union id="_555" context="_131" access="public" mangled="N12QXLCursorCmd4._26E" demangled="QXLCursorCmd::._26" location="f0:311" file="f0" line="311" artificial="1" size="104" align="8" members="_970 _971 _972 _973 _974 _975 _976 _977 _978 " bases=""/>
  <Destructor id="_556" name="QXLCursorCmd" artificial="1" throw="" context="_131" access="public" mangled="_ZN12QXLCursorCmdD1Ev *INTERNAL* " demangled="QXLCursorCmd::~QXLCursorCmd()" location="f0:308" file="f0" line="308" endline="308" inline="1">
  </Destructor>
  <OperatorMethod id="_557" name="=" returns="_979" artificial="1" throw="" context="_131" access="public" mangled="_ZN12QXLCursorCmdaSERKS_" demangled="QXLCursorCmd::operator=(QXLCursorCmd const&amp;)" location="f0:308" file="f0" line="308" endline="308" inline="1">
    <Argument type="_980" location="f0:308" file="f0" line="308"/>
  </OperatorMethod>
  <Constructor id="_558" name="QXLCursorCmd" artificial="1" throw="" context="_131" access="public" mangled="_ZN12QXLCursorCmdC1ERKS_ *INTERNAL* " demangled="QXLCursorCmd::QXLCursorCmd(QXLCursorCmd const&amp;)" location="f0:308" file="f0" line="308" endline="308" inline="1">
    <Argument type="_980" location="f0:308" file="f0" line="308"/>
  </Constructor>
  <Constructor id="_559" name="QXLCursorCmd" artificial="1" throw="" context="_131" access="public" mangled="_ZN12QXLCursorCmdC1Ev *INTERNAL* " demangled="QXLCursorCmd::QXLCursorCmd()" location="f0:308" file="f0" line="308" inline="1"/>
  <Field id="_560" name="n_modes" type="_149" offset="0" context="_135" access="public" location="f0:165" file="f0" line="165"/>
  <Field id="_561" name="modes" type="_981" offset="32" context="_135" access="public" location="f0:166" file="f0" line="166"/>
  <Destructor id="_562" name="QXLModes" artificial="1" throw="" context="_135" access="public" mangled="_ZN8QXLModesD1Ev *INTERNAL* " demangled="QXLModes::~QXLModes()" location="f0:164" file="f0" line="164" endline="164" inline="1">
  </Destructor>
  <OperatorMethod id="_563" name="=" returns="_982" artificial="1" throw="" context="_135" access="public" mangled="_ZN8QXLModesaSERKS_" demangled="QXLModes::operator=(QXLModes const&amp;)" location="f0:164" file="f0" line="164" endline="164" inline="1">
    <Argument type="_983" location="f0:164" file="f0" line="164"/>
  </OperatorMethod>
  <Constructor id="_564" name="QXLModes" artificial="1" throw="" context="_135" access="public" mangled="_ZN8QXLModesC1ERKS_ *INTERNAL* " demangled="QXLModes::QXLModes(QXLModes const&amp;)" location="f0:164" file="f0" line="164" endline="164" inline="1">
    <Argument type="_983" location="f0:164" file="f0" line="164"/>
  </Constructor>
  <Constructor id="_565" name="QXLModes" artificial="1" throw="" context="_135" access="public" mangled="_ZN8QXLModesC1Ev *INTERNAL* " demangled="QXLModes::QXLModes()" location="f0:164" file="f0" line="164" inline="1"/>
  <Field id="_566" name="data" type="_237" offset="0" context="_137" access="public" location="f0:181" file="f0" line="181"/>
  <Field id="_567" name="type" type="_149" offset="64" context="_137" access="public" location="f0:182" file="f0" line="182"/>
  <Field id="_568" name="padding" type="_149" offset="96" context="_137" access="public" location="f0:183" file="f0" line="183"/>
  <Destructor id="_569" name="QXLCommand" artificial="1" throw="" context="_137" access="public" mangled="_ZN10QXLCommandD1Ev *INTERNAL* " demangled="QXLCommand::~QXLCommand()" location="f0:180" file="f0" line="180" endline="180" inline="1">
  </Destructor>
  <OperatorMethod id="_570" name="=" returns="_984" artificial="1" throw="" context="_137" access="public" mangled="_ZN10QXLCommandaSERKS_" demangled="QXLCommand::operator=(QXLCommand const&amp;)" location="f0:180" file="f0" line="180" endline="180" inline="1">
    <Argument type="_985" location="f0:180" file="f0" line="180"/>
  </OperatorMethod>
  <Constructor id="_571" name="QXLCommand" artificial="1" throw="" context="_137" access="public" mangled="_ZN10QXLCommandC1ERKS_ *INTERNAL* " demangled="QXLCommand::QXLCommand(QXLCommand const&amp;)" location="f0:180" file="f0" line="180" endline="180" inline="1">
    <Argument type="_985" location="f0:180" file="f0" line="180"/>
  </Constructor>
  <Constructor id="_572" name="QXLCommand" artificial="1" throw="" context="_137" access="public" mangled="_ZN10QXLCommandC1Ev *INTERNAL* " demangled="QXLCommand::QXLCommand()" location="f0:180" file="f0" line="180" inline="1"/>
  <PointerType id="_573" type="_416" size="64" align="64"/>
  <PointerType id="_574" type="_417" size="64" align="64"/>
  <Field id="_575" name="src_bitmap" type="_237" offset="0" context="_150" access="public" location="f0:409" file="f0" line="409"/>
  <Field id="_576" name="src_area" type="_87" offset="64" context="_150" access="public" location="f0:410" file="f0" line="410"/>
  <Field id="_577" name="rop_descriptor" type="_288" offset="192" context="_150" access="public" location="f0:411" file="f0" line="411"/>
  <Field id="_578" name="scale_mode" type="_307" offset="208" context="_150" access="public" location="f0:412" file="f0" line="412"/>
  <Field id="_579" name="mask" type="_405" offset="216" context="_150" access="public" location="f0:413" file="f0" line="413"/>
  <Destructor id="_580" name="QXLCopy" artificial="1" throw="" context="_150" access="public" mangled="_ZN7QXLCopyD1Ev *INTERNAL* " demangled="QXLCopy::~QXLCopy()" location="f0:408" file="f0" line="408" endline="408" inline="1">
  </Destructor>
  <OperatorMethod id="_581" name="=" returns="_986" artificial="1" throw="" context="_150" access="public" mangled="_ZN7QXLCopyaSERKS_" demangled="QXLCopy::operator=(QXLCopy const&amp;)" location="f0:408" file="f0" line="408" endline="408" inline="1">
    <Argument type="_987" location="f0:408" file="f0" line="408"/>
  </OperatorMethod>
  <Constructor id="_582" name="QXLCopy" artificial="1" throw="" context="_150" access="public" mangled="_ZN7QXLCopyC1ERKS_ *INTERNAL* " demangled="QXLCopy::QXLCopy(QXLCopy const&amp;)" location="f0:408" file="f0" line="408" endline="408" inline="1">
    <Argument type="_987" location="f0:408" file="f0" line="408"/>
  </Constructor>
  <Constructor id="_583" name="QXLCopy" artificial="1" throw="" context="_150" access="public" mangled="_ZN7QXLCopyC1Ev *INTERNAL* " demangled="QXLCopy::QXLCopy()" location="f0:408" file="f0" line="408" inline="1"/>
  <Field id="_584" name="cmd" type="_138" offset="0" context="_155" access="public" location="f0:190" file="f0" line="190"/>
  <Field id="_585" name="group_id" type="_149" offset="128" context="_155" access="public" location="f0:191" file="f0" line="191"/>
  <Field id="_586" name="flags" type="_149" offset="160" context="_155" access="public" location="f0:192" file="f0" line="192"/>
  <Destructor id="_587" name="QXLCommandExt" artificial="1" throw="" context="_155" access="public" mangled="_ZN13QXLCommandExtD1Ev *INTERNAL* " demangled="QXLCommandExt::~QXLCommandExt()" location="f0:189" file="f0" line="189" endline="189" inline="1">
  </Destructor>
  <OperatorMethod id="_588" name="=" returns="_988" artificial="1" throw="" context="_155" access="public" mangled="_ZN13QXLCommandExtaSERKS_" demangled="QXLCommandExt::operator=(QXLCommandExt const&amp;)" location="f0:189" file="f0" line="189" endline="189" inline="1">
    <Argument type="_989" location="f0:189" file="f0" line="189"/>
  </OperatorMethod>
  <Constructor id="_589" name="QXLCommandExt" artificial="1" throw="" context="_155" access="public" mangled="_ZN13QXLCommandExtC1ERKS_ *INTERNAL* " demangled="QXLCommandExt::QXLCommandExt(QXLCommandExt const&amp;)" location="f0:189" file="f0" line="189" endline="189" inline="1">
    <Argument type="_989" location="f0:189" file="f0" line="189"/>
  </Constructor>
  <Constructor id="_590" name="QXLCommandExt" artificial="1" throw="" context="_155" access="public" mangled="_ZN13QXLCommandExtC1Ev *INTERNAL* " demangled="QXLCommandExt::QXLCommandExt()" location="f0:189" file="f0" line="189" inline="1"/>
  <Field id="_591" name="render_pos" type="_210" offset="0" context="_162" access="public" location="f0:344" file="f0" line="344"/>
  <Field id="_592" name="glyph_origin" type="_210" offset="64" context="_162" access="public" location="f0:345" file="f0" line="345"/>
  <Field id="_593" name="width" type="_288" offset="128" context="_162" access="public" location="f0:346" file="f0" line="346"/>
  <Field id="_594" name="height" type="_288" offset="144" context="_162" access="public" location="f0:347" file="f0" line="347"/>
  <Field id="_595" name="data" type="_990" offset="160" context="_162" access="public" location="f0:348" file="f0" line="348"/>
  <Destructor id="_596" name="QXLRasterGlyph" artificial="1" throw="" context="_162" access="public" mangled="_ZN14QXLRasterGlyphD1Ev *INTERNAL* " demangled="QXLRasterGlyph::~QXLRasterGlyph()" location="f0:343" file="f0" line="343" endline="343" inline="1">
  </Destructor>
  <OperatorMethod id="_597" name="=" returns="_991" artificial="1" throw="" context="_162" access="public" mangled="_ZN14QXLRasterGlyphaSERKS_" demangled="QXLRasterGlyph::operator=(QXLRasterGlyph const&amp;)" location="f0:343" file="f0" line="343" endline="343" inline="1">
    <Argument type="_992" location="f0:343" file="f0" line="343"/>
  </OperatorMethod>
  <Constructor id="_598" name="QXLRasterGlyph" artificial="1" throw="" context="_162" access="public" mangled="_ZN14QXLRasterGlyphC1ERKS_ *INTERNAL* " demangled="QXLRasterGlyph::QXLRasterGlyph(QXLRasterGlyph const&amp;)" location="f0:343" file="f0" line="343" endline="343" inline="1">
    <Argument type="_992" location="f0:343" file="f0" line="343"/>
  </Constructor>
  <Constructor id="_599" name="QXLRasterGlyph" artificial="1" throw="" context="_162" access="public" mangled="_ZN14QXLRasterGlyphC1Ev *INTERNAL* " demangled="QXLRasterGlyph::QXLRasterGlyph()" location="f0:343" file="f0" line="343" inline="1"/>
  <Field id="_600" name="pat" type="_237" offset="0" context="_166" access="public" location="f0:375" file="f0" line="375"/>
  <Field id="_601" name="pos" type="_210" offset="64" context="_166" access="public" location="f0:376" file="f0" line="376"/>
  <Destructor id="_602" name="QXLPattern" artificial="1" throw="" context="_166" access="public" mangled="_ZN10QXLPatternD1Ev *INTERNAL* " demangled="QXLPattern::~QXLPattern()" location="f0:374" file="f0" line="374" endline="374" inline="1">
  </Destructor>
  <OperatorMethod id="_603" name="=" returns="_993" artificial="1" throw="" context="_166" access="public" mangled="_ZN10QXLPatternaSERKS_" demangled="QXLPattern::operator=(QXLPattern const&amp;)" location="f0:374" file="f0" line="374" endline="374" inline="1">
    <Argument type="_994" location="f0:374" file="f0" line="374"/>
  </OperatorMethod>
  <Constructor id="_604" name="QXLPattern" artificial="1" throw="" context="_166" access="public" mangled="_ZN10QXLPatternC1ERKS_ *INTERNAL* " demangled="QXLPattern::QXLPattern(QXLPattern const&amp;)" location="f0:374" file="f0" line="374" endline="374" inline="1">
    <Argument type="_994" location="f0:374" file="f0" line="374"/>
  </Constructor>
  <Constructor id="_605" name="QXLPattern" artificial="1" throw="" context="_166" access="public" mangled="_ZN10QXLPatternC1Ev *INTERNAL* " demangled="QXLPattern::QXLPattern()" location="f0:374" file="f0" line="374" inline="1"/>
  <Field id="_606" name="data_size" type="_149" offset="0" context="_172" access="public" location="f0:578" file="f0" line="578"/>
  <Field id="_607" name="chunk" type="_129" offset="32" context="_172" access="public" location="f0:579" file="f0" line="579"/>
  <Destructor id="_608" name="QXLPath" artificial="1" throw="" context="_172" access="public" mangled="_ZN7QXLPathD1Ev *INTERNAL* " demangled="QXLPath::~QXLPath()" location="f0:577" file="f0" line="577" endline="577" inline="1">
  </Destructor>
  <OperatorMethod id="_609" name="=" returns="_995" artificial="1" throw="" context="_172" access="public" mangled="_ZN7QXLPathaSERKS_" demangled="QXLPath::operator=(QXLPath const&amp;)" location="f0:577" file="f0" line="577" endline="577" inline="1">
    <Argument type="_996" location="f0:577" file="f0" line="577"/>
  </OperatorMethod>
  <Constructor id="_610" name="QXLPath" artificial="1" throw="" context="_172" access="public" mangled="_ZN7QXLPathC1ERKS_ *INTERNAL* " demangled="QXLPath::QXLPath(QXLPath const&amp;)" location="f0:577" file="f0" line="577" endline="577" inline="1">
    <Argument type="_996" location="f0:577" file="f0" line="577"/>
  </Constructor>
  <Constructor id="_611" name="QXLPath" artificial="1" throw="" context="_172" access="public" mangled="_ZN7QXLPathC1Ev *INTERNAL* " demangled="QXLPath::QXLPath()" location="f0:577" file="f0" line="577" inline="1"/>
  <Field id="_612" name="mask" type="_405" offset="0" context="_183" access="public" location="f0:473" file="f0" line="473"/>
  <Destructor id="_613" name="QXLBlackness" artificial="1" throw="" context="_183" access="public" mangled="_ZN12QXLBlacknessD1Ev *INTERNAL* " demangled="QXLBlackness::~QXLBlackness()" location="f0:472" file="f0" line="472" endline="472" inline="1">
  </Destructor>
  <OperatorMethod id="_614" name="=" returns="_997" artificial="1" throw="" context="_183" access="public" mangled="_ZN12QXLBlacknessaSERKS_" demangled="QXLBlackness::operator=(QXLBlackness const&amp;)" location="f0:472" file="f0" line="472" endline="472" inline="1">
    <Argument type="_998" location="f0:472" file="f0" line="472"/>
  </OperatorMethod>
  <Constructor id="_615" name="QXLBlackness" artificial="1" throw="" context="_183" access="public" mangled="_ZN12QXLBlacknessC1ERKS_ *INTERNAL* " demangled="QXLBlackness::QXLBlackness(QXLBlackness const&amp;)" location="f0:472" file="f0" line="472" endline="472" inline="1">
    <Argument type="_998" location="f0:472" file="f0" line="472"/>
  </Constructor>
  <Constructor id="_616" name="QXLBlackness" artificial="1" throw="" context="_183" access="public" mangled="_ZN12QXLBlacknessC1Ev *INTERNAL* " demangled="QXLBlackness::QXLBlackness()" location="f0:472" file="f0" line="472" inline="1"/>
  <Field id="_617" name="surface_id" type="_149" offset="0" context="_185" access="public" location="f0:639" file="f0" line="639"/>
  <Destructor id="_618" name="QXLSurfaceId" artificial="1" throw="" context="_185" access="public" mangled="_ZN12QXLSurfaceIdD1Ev *INTERNAL* " demangled="QXLSurfaceId::~QXLSurfaceId()" location="f0:638" file="f0" line="638" endline="638" inline="1">
  </Destructor>
  <OperatorMethod id="_619" name="=" returns="_999" artificial="1" throw="" context="_185" access="public" mangled="_ZN12QXLSurfaceIdaSERKS_" demangled="QXLSurfaceId::operator=(QXLSurfaceId const&amp;)" location="f0:638" file="f0" line="638" endline="638" inline="1">
    <Argument type="_1000" location="f0:638" file="f0" line="638"/>
  </OperatorMethod>
  <Constructor id="_620" name="QXLSurfaceId" artificial="1" throw="" context="_185" access="public" mangled="_ZN12QXLSurfaceIdC1ERKS_ *INTERNAL* " demangled="QXLSurfaceId::QXLSurfaceId(QXLSurfaceId const&amp;)" location="f0:638" file="f0" line="638" endline="638" inline="1">
    <Argument type="_1000" location="f0:638" file="f0" line="638"/>
  </Constructor>
  <Constructor id="_621" name="QXLSurfaceId" artificial="1" throw="" context="_185" access="public" mangled="_ZN12QXLSurfaceIdC1Ev *INTERNAL* " demangled="QXLSurfaceId::QXLSurfaceId()" location="f0:638" file="f0" line="638" inline="1"/>
  <Field id="_622" name="alpha_flags" type="_288" offset="0" context="_194" access="public" location="f0:424" file="f0" line="424"/>
  <Field id="_623" name="alpha" type="_307" offset="16" context="_194" access="public" location="f0:425" file="f0" line="425"/>
  <Field id="_624" name="src_bitmap" type="_237" offset="24" context="_194" access="public" location="f0:426" file="f0" line="426"/>
  <Field id="_625" name="src_area" type="_87" offset="88" context="_194" access="public" location="f0:427" file="f0" line="427"/>
  <Destructor id="_626" name="QXLAlphaBlend" artificial="1" throw="" context="_194" access="public" mangled="_ZN13QXLAlphaBlendD1Ev *INTERNAL* " demangled="QXLAlphaBlend::~QXLAlphaBlend()" location="f0:423" file="f0" line="423" endline="423" inline="1">
  </Destructor>
  <OperatorMethod id="_627" name="=" returns="_1001" artificial="1" throw="" context="_194" access="public" mangled="_ZN13QXLAlphaBlendaSERKS_" demangled="QXLAlphaBlend::operator=(QXLAlphaBlend const&amp;)" location="f0:423" file="f0" line="423" endline="423" inline="1">
    <Argument type="_1002" location="f0:423" file="f0" line="423"/>
  </OperatorMethod>
  <Constructor id="_628" name="QXLAlphaBlend" artificial="1" throw="" context="_194" access="public" mangled="_ZN13QXLAlphaBlendC1ERKS_ *INTERNAL* " demangled="QXLAlphaBlend::QXLAlphaBlend(QXLAlphaBlend const&amp;)" location="f0:423" file="f0" line="423" endline="423" inline="1">
    <Argument type="_1002" location="f0:423" file="f0" line="423"/>
  </Constructor>
  <Constructor id="_629" name="QXLAlphaBlend" artificial="1" throw="" context="_194" access="public" mangled="_ZN13QXLAlphaBlendC1Ev *INTERNAL* " demangled="QXLAlphaBlend::QXLAlphaBlend()" location="f0:423" file="f0" line="423" inline="1"/>
  <Field id="_630" name="" type="_631" offset="0" context="_207" access="public" location="f0:223" file="f0" line="223"/>
  <Union id="_631" context="_207" access="public" mangled="N22QXLReleaseRing_ring_el4._24E" demangled="QXLReleaseRing_ring_el::._24" location="f0:223" file="f0" line="223" artificial="1" size="64" align="64" members="_1003 _1004 " bases=""/>
  <Destructor id="_632" name="QXLReleaseRing_ring_el" artificial="1" throw="" context="_207" access="public" mangled="_ZN22QXLReleaseRing_ring_elD1Ev *INTERNAL* " demangled="QXLReleaseRing_ring_el::~QXLReleaseRing_ring_el()" location="f0:223" file="f0" line="223" endline="223" inline="1">
  </Destructor>
  <OperatorMethod id="_633" name="=" returns="_1005" artificial="1" throw="" context="_207" access="public" mangled="_ZN22QXLReleaseRing_ring_elaSERKS_" demangled="QXLReleaseRing_ring_el::operator=(QXLReleaseRing_ring_el const&amp;)" location="f0:223" file="f0" line="223" endline="223" inline="1">
    <Argument type="_1006" location="f0:223" file="f0" line="223"/>
  </OperatorMethod>
  <Constructor id="_634" name="QXLReleaseRing_ring_el" artificial="1" throw="" context="_207" access="public" mangled="_ZN22QXLReleaseRing_ring_elC1ERKS_ *INTERNAL* " demangled="QXLReleaseRing_ring_el::QXLReleaseRing_ring_el(QXLReleaseRing_ring_el const&amp;)" location="f0:223" file="f0" line="223" endline="223" inline="1">
    <Argument type="_1006" location="f0:223" file="f0" line="223"/>
  </Constructor>
  <Constructor id="_635" name="QXLReleaseRing_ring_el" artificial="1" throw="" context="_207" access="public" mangled="_ZN22QXLReleaseRing_ring_elC1Ev *INTERNAL* " demangled="QXLReleaseRing_ring_el::QXLReleaseRing_ring_el()" location="f0:223" file="f0" line="223" inline="1"/>
  <Field id="_636" name="x" type="_276" offset="0" context="_209" access="public" location="f0:109" file="f0" line="109"/>
  <Field id="_637" name="y" type="_276" offset="32" context="_209" access="public" location="f0:110" file="f0" line="110"/>
  <Destructor id="_638" name="QXLPoint" artificial="1" throw="" context="_209" access="public" mangled="_ZN8QXLPointD1Ev *INTERNAL* " demangled="QXLPoint::~QXLPoint()" location="f0:108" file="f0" line="108" endline="108" inline="1">
  </Destructor>
  <OperatorMethod id="_639" name="=" returns="_1007" artificial="1" throw="" context="_209" access="public" mangled="_ZN8QXLPointaSERKS_" demangled="QXLPoint::operator=(QXLPoint const&amp;)" location="f0:108" file="f0" line="108" endline="108" inline="1">
    <Argument type="_1008" location="f0:108" file="f0" line="108"/>
  </OperatorMethod>
  <Constructor id="_640" name="QXLPoint" artificial="1" throw="" context="_209" access="public" mangled="_ZN8QXLPointC1ERKS_ *INTERNAL* " demangled="QXLPoint::QXLPoint(QXLPoint const&amp;)" location="f0:108" file="f0" line="108" endline="108" inline="1">
    <Argument type="_1008" location="f0:108" file="f0" line="108"/>
  </Constructor>
  <Constructor id="_641" name="QXLPoint" artificial="1" throw="" context="_209" access="public" mangled="_ZN8QXLPointC1Ev *INTERNAL* " demangled="QXLPoint::QXLPoint()" location="f0:108" file="f0" line="108" inline="1"/>
  <Field id="_642" name="num_rects" type="_149" offset="0" context="_216" access="public" location="f0:560" file="f0" line="560"/>
  <Field id="_643" name="chunk" type="_129" offset="32" context="_216" access="public" location="f0:561" file="f0" line="561"/>
  <Destructor id="_644" name="QXLClipRects" artificial="1" throw="" context="_216" access="public" mangled="_ZN12QXLClipRectsD1Ev *INTERNAL* " demangled="QXLClipRects::~QXLClipRects()" location="f0:559" file="f0" line="559" endline="559" inline="1">
  </Destructor>
  <OperatorMethod id="_645" name="=" returns="_1009" artificial="1" throw="" context="_216" access="public" mangled="_ZN12QXLClipRectsaSERKS_" demangled="QXLClipRects::operator=(QXLClipRects const&amp;)" location="f0:559" file="f0" line="559" endline="559" inline="1">
    <Argument type="_1010" location="f0:559" file="f0" line="559"/>
  </OperatorMethod>
  <Constructor id="_646" name="QXLClipRects" artificial="1" throw="" context="_216" access="public" mangled="_ZN12QXLClipRectsC1ERKS_ *INTERNAL* " demangled="QXLClipRects::QXLClipRects(QXLClipRects const&amp;)" location="f0:559" file="f0" line="559" endline="559" inline="1">
    <Argument type="_1010" location="f0:559" file="f0" line="559"/>
  </Constructor>
  <Constructor id="_647" name="QXLClipRects" artificial="1" throw="" context="_216" access="public" mangled="_ZN12QXLClipRectsC1Ev *INTERNAL* " demangled="QXLClipRects::QXLClipRects()" location="f0:559" file="f0" line="559" inline="1"/>
  <Field id="_648" name="release_info" type="_57" offset="0" context="_228" access="public" location="f0:272" file="f0" line="272"/>
  <Field id="_649" name="area" type="_87" offset="64" context="_228" access="public" location="f0:273" file="f0" line="273"/>
  <Field id="_650" name="update_id" type="_149" offset="192" context="_228" access="public" location="f0:274" file="f0" line="274"/>
  <Destructor id="_651" name="QXLCompatUpdateCmd" artificial="1" throw="" context="_228" access="public" mangled="_ZN18QXLCompatUpdateCmdD1Ev *INTERNAL* " demangled="QXLCompatUpdateCmd::~QXLCompatUpdateCmd()" location="f0:271" file="f0" line="271" endline="271" inline="1">
  </Destructor>
  <OperatorMethod id="_652" name="=" returns="_1011" artificial="1" throw="" context="_228" access="public" mangled="_ZN18QXLCompatUpdateCmdaSERKS_" demangled="QXLCompatUpdateCmd::operator=(QXLCompatUpdateCmd const&amp;)" location="f0:271" file="f0" line="271" endline="271" inline="1">
    <Argument type="_1012" location="f0:271" file="f0" line="271"/>
  </OperatorMethod>
  <Constructor id="_653" name="QXLCompatUpdateCmd" artificial="1" throw="" context="_228" access="public" mangled="_ZN18QXLCompatUpdateCmdC1ERKS_ *INTERNAL* " demangled="QXLCompatUpdateCmd::QXLCompatUpdateCmd(QXLCompatUpdateCmd const&amp;)" location="f0:271" file="f0" line="271" endline="271" inline="1">
    <Argument type="_1012" location="f0:271" file="f0" line="271"/>
  </Constructor>
  <Constructor id="_654" name="QXLCompatUpdateCmd" artificial="1" throw="" context="_228" access="public" mangled="_ZN18QXLCompatUpdateCmdC1Ev *INTERNAL* " demangled="QXLCompatUpdateCmd::QXLCompatUpdateCmd()" location="f0:271" file="f0" line="271" inline="1"/>
  <Field id="_655" name="format" type="_307" offset="0" context="_230" access="public" location="f0:629" file="f0" line="629"/>
  <Field id="_656" name="flags" type="_307" offset="8" context="_230" access="public" location="f0:630" file="f0" line="630"/>
  <Field id="_657" name="x" type="_149" offset="16" context="_230" access="public" location="f0:631" file="f0" line="631"/>
  <Field id="_658" name="y" type="_149" offset="48" context="_230" access="public" location="f0:632" file="f0" line="632"/>
  <Field id="_659" name="stride" type="_149" offset="80" context="_230" access="public" location="f0:633" file="f0" line="633"/>
  <Field id="_660" name="palette" type="_237" offset="112" context="_230" access="public" location="f0:634" file="f0" line="634"/>
  <Field id="_661" name="data" type="_237" offset="176" context="_230" access="public" location="f0:635" file="f0" line="635"/>
  <Destructor id="_662" name="QXLBitmap" artificial="1" throw="" context="_230" access="public" mangled="_ZN9QXLBitmapD1Ev *INTERNAL* " demangled="QXLBitmap::~QXLBitmap()" location="f0:628" file="f0" line="628" endline="628" inline="1">
  </Destructor>
  <OperatorMethod id="_663" name="=" returns="_1013" artificial="1" throw="" context="_230" access="public" mangled="_ZN9QXLBitmapaSERKS_" demangled="QXLBitmap::operator=(QXLBitmap const&amp;)" location="f0:628" file="f0" line="628" endline="628" inline="1">
    <Argument type="_1014" location="f0:628" file="f0" line="628"/>
  </OperatorMethod>
  <Constructor id="_664" name="QXLBitmap" artificial="1" throw="" context="_230" access="public" mangled="_ZN9QXLBitmapC1ERKS_ *INTERNAL* " demangled="QXLBitmap::QXLBitmap(QXLBitmap const&amp;)" location="f0:628" file="f0" line="628" endline="628" inline="1">
    <Argument type="_1014" location="f0:628" file="f0" line="628"/>
  </Constructor>
  <Constructor id="_665" name="QXLBitmap" artificial="1" throw="" context="_230" access="public" mangled="_ZN9QXLBitmapC1Ev *INTERNAL* " demangled="QXLBitmap::QXLBitmap()" location="f0:628" file="f0" line="628" inline="1"/>
  <Field id="_666" name="unique" type="_400" offset="0" context="_244" access="public" location="f0:285" file="f0" line="285"/>
  <Field id="_667" name="type" type="_288" offset="64" context="_244" access="public" location="f0:286" file="f0" line="286"/>
  <Field id="_668" name="width" type="_288" offset="80" context="_244" access="public" location="f0:287" file="f0" line="287"/>
  <Field id="_669" name="height" type="_288" offset="96" context="_244" access="public" location="f0:288" file="f0" line="288"/>
  <Field id="_670" name="hot_spot_x" type="_288" offset="112" context="_244" access="public" location="f0:289" file="f0" line="289"/>
  <Field id="_671" name="hot_spot_y" type="_288" offset="128" context="_244" access="public" location="f0:290" file="f0" line="290"/>
  <Destructor id="_672" name="QXLCursorHeader" artificial="1" throw="" context="_244" access="public" mangled="_ZN15QXLCursorHeaderD1Ev *INTERNAL* " demangled="QXLCursorHeader::~QXLCursorHeader()" location="f0:284" file="f0" line="284" endline="284" inline="1">
  </Destructor>
  <OperatorMethod id="_673" name="=" returns="_1015" artificial="1" throw="" context="_244" access="public" mangled="_ZN15QXLCursorHeaderaSERKS_" demangled="QXLCursorHeader::operator=(QXLCursorHeader const&amp;)" location="f0:284" file="f0" line="284" endline="284" inline="1">
    <Argument type="_1016" location="f0:284" file="f0" line="284"/>
  </OperatorMethod>
  <Constructor id="_674" name="QXLCursorHeader" artificial="1" throw="" context="_244" access="public" mangled="_ZN15QXLCursorHeaderC1ERKS_ *INTERNAL* " demangled="QXLCursorHeader::QXLCursorHeader(QXLCursorHeader const&amp;)" location="f0:284" file="f0" line="284" endline="284" inline="1">
    <Argument type="_1016" location="f0:284" file="f0" line="284"/>
  </Constructor>
  <Constructor id="_675" name="QXLCursorHeader" artificial="1" throw="" context="_244" access="public" mangled="_ZN15QXLCursorHeaderC1Ev *INTERNAL* " demangled="QXLCursorHeader::QXLCursorHeader()" location="f0:284" file="f0" line="284" inline="1"/>
  <Field id="_676" name="src_bitmap" type="_237" offset="0" context="_247" access="public" location="f0:417" file="f0" line="417"/>
  <Field id="_677" name="src_area" type="_87" offset="64" context="_247" access="public" location="f0:418" file="f0" line="418"/>
  <Field id="_678" name="src_color" type="_149" offset="192" context="_247" access="public" location="f0:419" file="f0" line="419"/>
  <Field id="_679" name="true_color" type="_149" offset="224" context="_247" access="public" location="f0:420" file="f0" line="420"/>
  <Destructor id="_680" name="QXLTransparent" artificial="1" throw="" context="_247" access="public" mangled="_ZN14QXLTransparentD1Ev *INTERNAL* " demangled="QXLTransparent::~QXLTransparent()" location="f0:416" file="f0" line="416" endline="416" inline="1">
  </Destructor>
  <OperatorMethod id="_681" name="=" returns="_1017" artificial="1" throw="" context="_247" access="public" mangled="_ZN14QXLTransparentaSERKS_" demangled="QXLTransparent::operator=(QXLTransparent const&amp;)" location="f0:416" file="f0" line="416" endline="416" inline="1">
    <Argument type="_1018" location="f0:416" file="f0" line="416"/>
  </OperatorMethod>
  <Constructor id="_682" name="QXLTransparent" artificial="1" throw="" context="_247" access="public" mangled="_ZN14QXLTransparentC1ERKS_ *INTERNAL* " demangled="QXLTransparent::QXLTransparent(QXLTransparent const&amp;)" location="f0:416" file="f0" line="416" endline="416" inline="1">
    <Argument type="_1018" location="f0:416" file="f0" line="416"/>
  </Constructor>
  <Constructor id="_683" name="QXLTransparent" artificial="1" throw="" context="_247" access="public" mangled="_ZN14QXLTransparentC1Ev *INTERNAL* " demangled="QXLTransparent::QXLTransparent()" location="f0:416" file="f0" line="416" inline="1"/>
  <Field id="_684" name="src_pos" type="_210" offset="0" context="_254" access="public" location="f0:359" file="f0" line="359"/>
  <Destructor id="_685" name="QXLCopyBits" artificial="1" throw="" context="_254" access="public" mangled="_ZN11QXLCopyBitsD1Ev *INTERNAL* " demangled="QXLCopyBits::~QXLCopyBits()" location="f0:358" file="f0" line="358" endline="358" inline="1">
  </Destructor>
  <OperatorMethod id="_686" name="=" returns="_1019" artificial="1" throw="" context="_254" access="public" mangled="_ZN11QXLCopyBitsaSERKS_" demangled="QXLCopyBits::operator=(QXLCopyBits const&amp;)" location="f0:358" file="f0" line="358" endline="358" inline="1">
    <Argument type="_1020" location="f0:358" file="f0" line="358"/>
  </OperatorMethod>
  <Constructor id="_687" name="QXLCopyBits" artificial="1" throw="" context="_254" access="public" mangled="_ZN11QXLCopyBitsC1ERKS_ *INTERNAL* " demangled="QXLCopyBits::QXLCopyBits(QXLCopyBits const&amp;)" location="f0:358" file="f0" line="358" endline="358" inline="1">
    <Argument type="_1020" location="f0:358" file="f0" line="358"/>
  </Constructor>
  <Constructor id="_688" name="QXLCopyBits" artificial="1" throw="" context="_254" access="public" mangled="_ZN11QXLCopyBitsC1Ev *INTERNAL* " demangled="QXLCopyBits::QXLCopyBits()" location="f0:358" file="f0" line="358" inline="1"/>
  <Field id="_689" name="num_items" type="_149" offset="0" context="_257" access="public" location="f0:223" file="f0" line="223"/>
  <Field id="_690" name="prod" type="_149" offset="32" context="_257" access="public" location="f0:223" file="f0" line="223"/>
  <Field id="_691" name="notify_on_prod" type="_149" offset="64" context="_257" access="public" location="f0:223" file="f0" line="223"/>
  <Field id="_692" name="cons" type="_149" offset="96" context="_257" access="public" location="f0:223" file="f0" line="223"/>
  <Field id="_693" name="notify_on_cons" type="_149" offset="128" context="_257" access="public" location="f0:223" file="f0" line="223"/>
  <Field id="_694" name="items" type="_1021" offset="160" context="_257" access="public" location="f0:223" file="f0" line="223"/>
  <Destructor id="_695" name="QXLReleaseRing" artificial="1" throw="" context="_257" access="public" mangled="_ZN14QXLReleaseRingD1Ev *INTERNAL* " demangled="QXLReleaseRing::~QXLReleaseRing()" location="f0:223" file="f0" line="223" endline="223" inline="1">
  </Destructor>
  <OperatorMethod id="_696" name="=" returns="_1022" artificial="1" throw="" context="_257" access="public" mangled="_ZN14QXLReleaseRingaSERKS_" demangled="QXLReleaseRing::operator=(QXLReleaseRing const&amp;)" location="f0:223" file="f0" line="223" endline="223" inline="1">
    <Argument type="_1023" location="f0:223" file="f0" line="223"/>
  </OperatorMethod>
  <Constructor id="_697" name="QXLReleaseRing" artificial="1" throw="" context="_257" access="public" mangled="_ZN14QXLReleaseRingC1ERKS_ *INTERNAL* " demangled="QXLReleaseRing::QXLReleaseRing(QXLReleaseRing const&amp;)" location="f0:223" file="f0" line="223" endline="223" inline="1">
    <Argument type="_1023" location="f0:223" file="f0" line="223"/>
  </Constructor>
  <Constructor id="_698" name="QXLReleaseRing" artificial="1" throw="" context="_257" access="public" mangled="_ZN14QXLReleaseRingC1Ev *INTERNAL* " demangled="QXLReleaseRing::QXLReleaseRing()" location="f0:223" file="f0" line="223" inline="1"/>
  <Field id="_699" name="data_size" type="_149" offset="0" context="_259" access="public" location="f0:352" file="f0" line="352"/>
  <Field id="_700" name="length" type="_288" offset="32" context="_259" access="public" location="f0:353" file="f0" line="353"/>
  <Field id="_701" name="flags" type="_288" offset="48" context="_259" access="public" location="f0:354" file="f0" line="354"/>
  <Field id="_702" name="chunk" type="_129" offset="64" context="_259" access="public" location="f0:355" file="f0" line="355"/>
  <Destructor id="_703" name="QXLString" artificial="1" throw="" context="_259" access="public" mangled="_ZN9QXLStringD1Ev *INTERNAL* " demangled="QXLString::~QXLString()" location="f0:351" file="f0" line="351" endline="351" inline="1">
  </Destructor>
  <OperatorMethod id="_704" name="=" returns="_1024" artificial="1" throw="" context="_259" access="public" mangled="_ZN9QXLStringaSERKS_" demangled="QXLString::operator=(QXLString const&amp;)" location="f0:351" file="f0" line="351" endline="351" inline="1">
    <Argument type="_1025" location="f0:351" file="f0" line="351"/>
  </OperatorMethod>
  <Constructor id="_705" name="QXLString" artificial="1" throw="" context="_259" access="public" mangled="_ZN9QXLStringC1ERKS_ *INTERNAL* " demangled="QXLString::QXLString(QXLString const&amp;)" location="f0:351" file="f0" line="351" endline="351" inline="1">
    <Argument type="_1025" location="f0:351" file="f0" line="351"/>
  </Constructor>
  <Constructor id="_706" name="QXLString" artificial="1" throw="" context="_259" access="public" mangled="_ZN9QXLStringC1Ev *INTERNAL* " demangled="QXLString::QXLString()" location="f0:351" file="f0" line="351" inline="1"/>
  <Field id="_707" name="id" type="_400" offset="0" context="_261" access="public" location="f0:615" file="f0" line="615"/>
  <Field id="_708" name="type" type="_307" offset="64" context="_261" access="public" location="f0:616" file="f0" line="616"/>
  <Field id="_709" name="flags" type="_307" offset="72" context="_261" access="public" location="f0:617" file="f0" line="617"/>
  <Field id="_710" name="width" type="_149" offset="80" context="_261" access="public" location="f0:618" file="f0" line="618"/>
  <Field id="_711" name="height" type="_149" offset="112" context="_261" access="public" location="f0:619" file="f0" line="619"/>
  <Destructor id="_712" name="QXLImageDescriptor" artificial="1" throw="" context="_261" access="public" mangled="_ZN18QXLImageDescriptorD1Ev *INTERNAL* " demangled="QXLImageDescriptor::~QXLImageDescriptor()" location="f0:614" file="f0" line="614" endline="614" inline="1">
  </Destructor>
  <OperatorMethod id="_713" name="=" returns="_1026" artificial="1" throw="" context="_261" access="public" mangled="_ZN18QXLImageDescriptoraSERKS_" demangled="QXLImageDescriptor::operator=(QXLImageDescriptor const&amp;)" location="f0:614" file="f0" line="614" endline="614" inline="1">
    <Argument type="_1027" location="f0:614" file="f0" line="614"/>
  </OperatorMethod>
  <Constructor id="_714" name="QXLImageDescriptor" artificial="1" throw="" context="_261" access="public" mangled="_ZN18QXLImageDescriptorC1ERKS_ *INTERNAL* " demangled="QXLImageDescriptor::QXLImageDescriptor(QXLImageDescriptor const&amp;)" location="f0:614" file="f0" line="614" endline="614" inline="1">
    <Argument type="_1027" location="f0:614" file="f0" line="614"/>
  </Constructor>
  <Constructor id="_715" name="QXLImageDescriptor" artificial="1" throw="" context="_261" access="public" mangled="_ZN18QXLImageDescriptorC1Ev *INTERNAL* " demangled="QXLImageDescriptor::QXLImageDescriptor()" location="f0:614" file="f0" line="614" inline="1"/>
  <Field id="_716" name="src_bitmap" type="_237" offset="0" context="_272" access="public" location="f0:400" file="f0" line="400"/>
  <Field id="_717" name="src_area" type="_87" offset="64" context="_272" access="public" location="f0:401" file="f0" line="401"/>
  <Field id="_718" name="brush" type="_375" offset="192" context="_272" access="public" location="f0:402" file="f0" line="402"/>
  <Field id="_719" name="rop_descriptor" type="_288" offset="352" context="_272" access="public" location="f0:403" file="f0" line="403"/>
  <Field id="_720" name="scale_mode" type="_307" offset="368" context="_272" access="public" location="f0:404" file="f0" line="404"/>
  <Field id="_721" name="mask" type="_405" offset="376" context="_272" access="public" location="f0:405" file="f0" line="405"/>
  <Destructor id="_722" name="QXLOpaque" artificial="1" throw="" context="_272" access="public" mangled="_ZN9QXLOpaqueD1Ev *INTERNAL* " demangled="QXLOpaque::~QXLOpaque()" location="f0:399" file="f0" line="399" endline="399" inline="1">
  </Destructor>
  <OperatorMethod id="_723" name="=" returns="_1028" artificial="1" throw="" context="_272" access="public" mangled="_ZN9QXLOpaqueaSERKS_" demangled="QXLOpaque::operator=(QXLOpaque const&amp;)" location="f0:399" file="f0" line="399" endline="399" inline="1">
    <Argument type="_1029" location="f0:399" file="f0" line="399"/>
  </OperatorMethod>
  <Constructor id="_724" name="QXLOpaque" artificial="1" throw="" context="_272" access="public" mangled="_ZN9QXLOpaqueC1ERKS_ *INTERNAL* " demangled="QXLOpaque::QXLOpaque(QXLOpaque const&amp;)" location="f0:399" file="f0" line="399" endline="399" inline="1">
    <Argument type="_1029" location="f0:399" file="f0" line="399"/>
  </Constructor>
  <Constructor id="_725" name="QXLOpaque" artificial="1" throw="" context="_272" access="public" mangled="_ZN9QXLOpaqueC1Ev *INTERNAL* " demangled="QXLOpaque::QXLOpaque()" location="f0:399" file="f0" line="399" inline="1"/>
  <Field id="_726" name="release_info" type="_57" offset="0" context="_281" access="public" location="f0:508" file="f0" line="508"/>
  <Field id="_727" name="surface_id" type="_149" offset="64" context="_281" access="public" location="f0:509" file="f0" line="509"/>
  <Field id="_728" name="effect" type="_307" offset="96" context="_281" access="public" location="f0:510" file="f0" line="510"/>
  <Field id="_729" name="type" type="_307" offset="104" context="_281" access="public" location="f0:511" file="f0" line="511"/>
  <Field id="_730" name="self_bitmap" type="_307" offset="112" context="_281" access="public" location="f0:512" file="f0" line="512"/>
  <Field id="_731" name="self_bitmap_area" type="_87" offset="120" context="_281" access="public" location="f0:513" file="f0" line="513"/>
  <Field id="_732" name="bbox" type="_87" offset="248" context="_281" access="public" location="f0:514" file="f0" line="514"/>
  <Field id="_733" name="clip" type="_303" offset="376" context="_281" access="public" location="f0:515" file="f0" line="515"/>
  <Field id="_734" name="mm_time" type="_149" offset="472" context="_281" access="public" location="f0:516" file="f0" line="516"/>
  <Field id="_735" name="surfaces_dest" type="_1030" offset="504" context="_281" access="public" location="f0:517" file="f0" line="517"/>
  <Field id="_736" name="surfaces_rects" type="_1031" offset="600" context="_281" access="public" location="f0:518" file="f0" line="518"/>
  <Field id="_737" name="u" type="_738" offset="984" context="_281" access="public" location="f0:533" file="f0" line="533"/>
  <Union id="_738" context="_281" access="public" mangled="N11QXLDrawable4._32E" demangled="QXLDrawable::._32" location="f0:519" file="f0" line="519" artificial="1" size="544" align="8" members="_1032 _1033 _1034 _1035 _1036 _1037 _1038 _1039 _1040 _1041 _1042 _1043 _1044 _1045 _1046 _1047 _1048 " bases=""/>
  <Destructor id="_739" name="QXLDrawable" artificial="1" throw="" context="_281" access="public" mangled="_ZN11QXLDrawableD1Ev *INTERNAL* " demangled="QXLDrawable::~QXLDrawable()" location="f0:507" file="f0" line="507" endline="507" inline="1">
  </Destructor>
  <OperatorMethod id="_740" name="=" returns="_1049" artificial="1" throw="" context="_281" access="public" mangled="_ZN11QXLDrawableaSERKS_" demangled="QXLDrawable::operator=(QXLDrawable const&amp;)" location="f0:507" file="f0" line="507" endline="507" inline="1">
    <Argument type="_1050" location="f0:507" file="f0" line="507"/>
  </OperatorMethod>
  <Constructor id="_741" name="QXLDrawable" artificial="1" throw="" context="_281" access="public" mangled="_ZN11QXLDrawableC1ERKS_ *INTERNAL* " demangled="QXLDrawable::QXLDrawable(QXLDrawable const&amp;)" location="f0:507" file="f0" line="507" endline="507" inline="1">
    <Argument type="_1050" location="f0:507" file="f0" line="507"/>
  </Constructor>
  <Constructor id="_742" name="QXLDrawable" artificial="1" throw="" context="_281" access="public" mangled="_ZN11QXLDrawableC1Ev *INTERNAL* " demangled="QXLDrawable::QXLDrawable()" location="f0:507" file="f0" line="507" inline="1"/>
  <Field id="_743" name="width" type="_149" offset="0" context="_285" access="public" location="f0:205" file="f0" line="205"/>
  <Field id="_744" name="height" type="_149" offset="32" context="_285" access="public" location="f0:206" file="f0" line="206"/>
  <Field id="_745" name="stride" type="_276" offset="64" context="_285" access="public" location="f0:207" file="f0" line="207"/>
  <Field id="_746" name="format" type="_149" offset="96" context="_285" access="public" location="f0:208" file="f0" line="208"/>
  <Field id="_747" name="position" type="_149" offset="128" context="_285" access="public" location="f0:209" file="f0" line="209"/>
  <Field id="_748" name="mouse_mode" type="_149" offset="160" context="_285" access="public" location="f0:210" file="f0" line="210"/>
  <Field id="_749" name="flags" type="_149" offset="192" context="_285" access="public" location="f0:211" file="f0" line="211"/>
  <Field id="_750" name="type" type="_149" offset="224" context="_285" access="public" location="f0:212" file="f0" line="212"/>
  <Field id="_751" name="mem" type="_237" offset="256" context="_285" access="public" location="f0:213" file="f0" line="213"/>
  <Destructor id="_752" name="QXLSurfaceCreate" artificial="1" throw="" context="_285" access="public" mangled="_ZN16QXLSurfaceCreateD1Ev *INTERNAL* " demangled="QXLSurfaceCreate::~QXLSurfaceCreate()" location="f0:204" file="f0" line="204" endline="204" inline="1">
  </Destructor>
  <OperatorMethod id="_753" name="=" returns="_1051" artificial="1" throw="" context="_285" access="public" mangled="_ZN16QXLSurfaceCreateaSERKS_" demangled="QXLSurfaceCreate::operator=(QXLSurfaceCreate const&amp;)" location="f0:204" file="f0" line="204" endline="204" inline="1">
    <Argument type="_1052" location="f0:204" file="f0" line="204"/>
  </OperatorMethod>
  <Constructor id="_754" name="QXLSurfaceCreate" artificial="1" throw="" context="_285" access="public" mangled="_ZN16QXLSurfaceCreateC1ERKS_ *INTERNAL* " demangled="QXLSurfaceCreate::QXLSurfaceCreate(QXLSurfaceCreate const&amp;)" location="f0:204" file="f0" line="204" endline="204" inline="1">
    <Argument type="_1052" location="f0:204" file="f0" line="204"/>
  </Constructor>
  <Constructor id="_755" name="QXLSurfaceCreate" artificial="1" throw="" context="_285" access="public" mangled="_ZN16QXLSurfaceCreateC1Ev *INTERNAL* " demangled="QXLSurfaceCreate::QXLSurfaceCreate()" location="f0:204" file="f0" line="204" inline="1"/>
  <Field id="_756" name="release_info" type="_57" offset="0" context="_290" access="public" location="f0:550" file="f0" line="550"/>
  <Field id="_757" name="surface_id" type="_149" offset="64" context="_290" access="public" location="f0:551" file="f0" line="551"/>
  <Field id="_758" name="type" type="_307" offset="96" context="_290" access="public" location="f0:552" file="f0" line="552"/>
  <Field id="_759" name="flags" type="_149" offset="104" context="_290" access="public" location="f0:553" file="f0" line="553"/>
  <Field id="_760" name="u" type="_761" offset="136" context="_290" access="public" location="f0:556" file="f0" line="556"/>
  <Union id="_761" context="_290" access="public" mangled="N13QXLSurfaceCmd4._33E" demangled="QXLSurfaceCmd::._33" location="f0:554" file="f0" line="554" artificial="1" size="192" align="8" members="_1053 _1054 _1055 _1056 _1057 " bases=""/>
  <Destructor id="_762" name="QXLSurfaceCmd" artificial="1" throw="" context="_290" access="public" mangled="_ZN13QXLSurfaceCmdD1Ev *INTERNAL* " demangled="QXLSurfaceCmd::~QXLSurfaceCmd()" location="f0:549" file="f0" line="549" endline="549" inline="1">
  </Destructor>
  <OperatorMethod id="_763" name="=" returns="_1058" artificial="1" throw="" context="_290" access="public" mangled="_ZN13QXLSurfaceCmdaSERKS_" demangled="QXLSurfaceCmd::operator=(QXLSurfaceCmd const&amp;)" location="f0:549" file="f0" line="549" endline="549" inline="1">
    <Argument type="_1059" location="f0:549" file="f0" line="549"/>
  </OperatorMethod>
  <Constructor id="_764" name="QXLSurfaceCmd" artificial="1" throw="" context="_290" access="public" mangled="_ZN13QXLSurfaceCmdC1ERKS_ *INTERNAL* " demangled="QXLSurfaceCmd::QXLSurfaceCmd(QXLSurfaceCmd const&amp;)" location="f0:549" file="f0" line="549" endline="549" inline="1">
    <Argument type="_1059" location="f0:549" file="f0" line="549"/>
  </Constructor>
  <Constructor id="_765" name="QXLSurfaceCmd" artificial="1" throw="" context="_290" access="public" mangled="_ZN13QXLSurfaceCmdC1Ev *INTERNAL* " demangled="QXLSurfaceCmd::QXLSurfaceCmd()" location="f0:549" file="f0" line="549" inline="1"/>
  <Field id="_766" name="group" type="_149" offset="0" context="_293" access="public" location="f0:590" file="f0" line="590"/>
  <Field id="_767" name="unique" type="_149" offset="32" context="_293" access="public" location="f0:591" file="f0" line="591"/>
  <Destructor id="_768" name="QXLImageID" artificial="1" throw="" context="_293" access="public" mangled="_ZN10QXLImageIDD1Ev *INTERNAL* " demangled="QXLImageID::~QXLImageID()" location="f0:589" file="f0" line="589" endline="589" inline="1">
  </Destructor>
  <OperatorMethod id="_769" name="=" returns="_1060" artificial="1" throw="" context="_293" access="public" mangled="_ZN10QXLImageIDaSERKS_" demangled="QXLImageID::operator=(QXLImageID const&amp;)" location="f0:589" file="f0" line="589" endline="589" inline="1">
    <Argument type="_1061" location="f0:589" file="f0" line="589"/>
  </OperatorMethod>
  <Constructor id="_770" name="QXLImageID" artificial="1" throw="" context="_293" access="public" mangled="_ZN10QXLImageIDC1ERKS_ *INTERNAL* " demangled="QXLImageID::QXLImageID(QXLImageID const&amp;)" location="f0:589" file="f0" line="589" endline="589" inline="1">
    <Argument type="_1061" location="f0:589" file="f0" line="589"/>
  </Constructor>
  <Constructor id="_771" name="QXLImageID" artificial="1" throw="" context="_293" access="public" mangled="_ZN10QXLImageIDC1Ev *INTERNAL* " demangled="QXLImageID::QXLImageID()" location="f0:589" file="f0" line="589" inline="1"/>
  <Field id="_772" name="type" type="_149" offset="0" context="_302" access="public" location="f0:477" file="f0" line="477"/>
  <Field id="_773" name="data" type="_237" offset="32" context="_302" access="public" location="f0:478" file="f0" line="478"/>
  <Destructor id="_774" name="QXLClip" artificial="1" throw="" context="_302" access="public" mangled="_ZN7QXLClipD1Ev *INTERNAL* " demangled="QXLClip::~QXLClip()" location="f0:476" file="f0" line="476" endline="476" inline="1">
  </Destructor>
  <OperatorMethod id="_775" name="=" returns="_1062" artificial="1" throw="" context="_302" access="public" mangled="_ZN7QXLClipaSERKS_" demangled="QXLClip::operator=(QXLClip const&amp;)" location="f0:476" file="f0" line="476" endline="476" inline="1">
    <Argument type="_1063" location="f0:476" file="f0" line="476"/>
  </OperatorMethod>
  <Constructor id="_776" name="QXLClip" artificial="1" throw="" context="_302" access="public" mangled="_ZN7QXLClipC1ERKS_ *INTERNAL* " demangled="QXLClip::QXLClip(QXLClip const&amp;)" location="f0:476" file="f0" line="476" endline="476" inline="1">
    <Argument type="_1063" location="f0:476" file="f0" line="476"/>
  </Constructor>
  <Constructor id="_777" name="QXLClip" artificial="1" throw="" context="_302" access="public" mangled="_ZN7QXLClipC1Ev *INTERNAL* " demangled="QXLClip::QXLClip()" location="f0:476" file="f0" line="476" inline="1"/>
  <Field id="_778" name="header" type="_245" offset="0" context="_305" access="public" location="f0:294" file="f0" line="294"/>
  <Field id="_779" name="data_size" type="_149" offset="144" context="_305" access="public" location="f0:295" file="f0" line="295"/>
  <Field id="_780" name="chunk" type="_129" offset="176" context="_305" access="public" location="f0:296" file="f0" line="296"/>
  <Destructor id="_781" name="QXLCursor" artificial="1" throw="" context="_305" access="public" mangled="_ZN9QXLCursorD1Ev *INTERNAL* " demangled="QXLCursor::~QXLCursor()" location="f0:293" file="f0" line="293" endline="293" inline="1">
  </Destructor>
  <OperatorMethod id="_782" name="=" returns="_1064" artificial="1" throw="" context="_305" access="public" mangled="_ZN9QXLCursoraSERKS_" demangled="QXLCursor::operator=(QXLCursor const&amp;)" location="f0:293" file="f0" line="293" endline="293" inline="1">
    <Argument type="_1065" location="f0:293" file="f0" line="293"/>
  </OperatorMethod>
  <Constructor id="_783" name="QXLCursor" artificial="1" throw="" context="_305" access="public" mangled="_ZN9QXLCursorC1ERKS_ *INTERNAL* " demangled="QXLCursor::QXLCursor(QXLCursor const&amp;)" location="f0:293" file="f0" line="293" endline="293" inline="1">
    <Argument type="_1065" location="f0:293" file="f0" line="293"/>
  </Constructor>
  <Constructor id="_784" name="QXLCursor" artificial="1" throw="" context="_305" access="public" mangled="_ZN9QXLCursorC1Ev *INTERNAL* " demangled="QXLCursor::QXLCursor()" location="f0:293" file="f0" line="293" inline="1"/>
  <Field id="_785" name="id" type="_294" offset="0" context="_308" access="public" location="f0:595" file="f0" line="595"/>
  <Field id="_786" name="value" type="_400" offset="0" context="_308" access="public" location="f0:596" file="f0" line="596"/>
  <Destructor id="_787" name="._36" artificial="1" throw="" context="_308" access="public" mangled="_ZN15QXLImageIDUnionD1Ev *INTERNAL* " demangled="QXLImageIDUnion::~QXLImageIDUnion()" location="f0:597" file="f0" line="597" endline="597" inline="1">
  </Destructor>
  <OperatorMethod id="_788" name="=" returns="_1066" artificial="1" throw="" context="_308" access="public" mangled="_ZN15QXLImageIDUnionaSERKS_" demangled="QXLImageIDUnion::operator=(QXLImageIDUnion const&amp;)" location="f0:597" file="f0" line="597" endline="597" inline="1">
    <Argument type="_1067" location="f0:594" file="f0" line="594"/>
  </OperatorMethod>
  <Constructor id="_789" name="._36" artificial="1" throw="" context="_308" access="public" mangled="_ZN15QXLImageIDUnionC1ERKS_ *INTERNAL* " demangled="QXLImageIDUnion::QXLImageIDUnion(QXLImageIDUnion const&amp;)" location="f0:597" file="f0" line="597" endline="597" inline="1">
    <Argument type="_1067" location="f0:594" file="f0" line="594"/>
  </Constructor>
  <Constructor id="_790" name="._36" artificial="1" throw="" context="_308" access="public" mangled="_ZN15QXLImageIDUnionC1Ev *INTERNAL* " demangled="QXLImageIDUnion::QXLImageIDUnion()" location="f0:597" file="f0" line="597" inline="1"/>
  <Field id="_791" name="brush" type="_375" offset="0" context="_310" access="public" location="f0:394" file="f0" line="394"/>
  <Field id="_792" name="rop_descriptor" type="_288" offset="160" context="_310" access="public" location="f0:395" file="f0" line="395"/>
  <Field id="_793" name="mask" type="_405" offset="176" context="_310" access="public" location="f0:396" file="f0" line="396"/>
  <Destructor id="_794" name="QXLFill" artificial="1" throw="" context="_310" access="public" mangled="_ZN7QXLFillD1Ev *INTERNAL* " demangled="QXLFill::~QXLFill()" location="f0:393" file="f0" line="393" endline="393" inline="1">
  </Destructor>
  <OperatorMethod id="_795" name="=" returns="_1068" artificial="1" throw="" context="_310" access="public" mangled="_ZN7QXLFillaSERKS_" demangled="QXLFill::operator=(QXLFill const&amp;)" location="f0:393" file="f0" line="393" endline="393" inline="1">
    <Argument type="_1069" location="f0:393" file="f0" line="393"/>
  </OperatorMethod>
  <Constructor id="_796" name="QXLFill" artificial="1" throw="" context="_310" access="public" mangled="_ZN7QXLFillC1ERKS_ *INTERNAL* " demangled="QXLFill::QXLFill(QXLFill const&amp;)" location="f0:393" file="f0" line="393" endline="393" inline="1">
    <Argument type="_1069" location="f0:393" file="f0" line="393"/>
  </Constructor>
  <Constructor id="_797" name="QXLFill" artificial="1" throw="" context="_310" access="public" mangled="_ZN7QXLFillC1Ev *INTERNAL* " demangled="QXLFill::QXLFill()" location="f0:393" file="f0" line="393" inline="1"/>
  <Field id="_798" name="unique" type="_400" offset="0" context="_312" access="public" location="f0:623" file="f0" line="623"/>
  <Field id="_799" name="num_ents" type="_288" offset="64" context="_312" access="public" location="f0:624" file="f0" line="624"/>
  <Field id="_800" name="ents" type="_1070" offset="80" context="_312" access="public" location="f0:625" file="f0" line="625"/>
  <Destructor id="_801" name="QXLPalette" artificial="1" throw="" context="_312" access="public" mangled="_ZN10QXLPaletteD1Ev *INTERNAL* " demangled="QXLPalette::~QXLPalette()" location="f0:622" file="f0" line="622" endline="622" inline="1">
  </Destructor>
  <OperatorMethod id="_802" name="=" returns="_1071" artificial="1" throw="" context="_312" access="public" mangled="_ZN10QXLPaletteaSERKS_" demangled="QXLPalette::operator=(QXLPalette const&amp;)" location="f0:622" file="f0" line="622" endline="622" inline="1">
    <Argument type="_1072" location="f0:622" file="f0" line="622"/>
  </OperatorMethod>
  <Constructor id="_803" name="QXLPalette" artificial="1" throw="" context="_312" access="public" mangled="_ZN10QXLPaletteC1ERKS_ *INTERNAL* " demangled="QXLPalette::QXLPalette(QXLPalette const&amp;)" location="f0:622" file="f0" line="622" endline="622" inline="1">
    <Argument type="_1072" location="f0:622" file="f0" line="622"/>
  </Constructor>
  <Constructor id="_804" name="QXLPalette" artificial="1" throw="" context="_312" access="public" mangled="_ZN10QXLPaletteC1Ev *INTERNAL* " demangled="QXLPalette::QXLPalette()" location="f0:622" file="f0" line="622" inline="1"/>
  <Field id="_805" name="format" type="_149" offset="0" context="_327" access="public" location="f0:542" file="f0" line="542"/>
  <Field id="_806" name="width" type="_149" offset="32" context="_327" access="public" location="f0:543" file="f0" line="543"/>
  <Field id="_807" name="height" type="_149" offset="64" context="_327" access="public" location="f0:544" file="f0" line="544"/>
  <Field id="_808" name="stride" type="_276" offset="96" context="_327" access="public" location="f0:545" file="f0" line="545"/>
  <Field id="_809" name="data" type="_237" offset="128" context="_327" access="public" location="f0:546" file="f0" line="546"/>
  <Destructor id="_810" name="QXLSurface" artificial="1" throw="" context="_327" access="public" mangled="_ZN10QXLSurfaceD1Ev *INTERNAL* " demangled="QXLSurface::~QXLSurface()" location="f0:541" file="f0" line="541" endline="541" inline="1">
  </Destructor>
  <OperatorMethod id="_811" name="=" returns="_1073" artificial="1" throw="" context="_327" access="public" mangled="_ZN10QXLSurfaceaSERKS_" demangled="QXLSurface::operator=(QXLSurface const&amp;)" location="f0:541" file="f0" line="541" endline="541" inline="1">
    <Argument type="_1074" location="f0:541" file="f0" line="541"/>
  </OperatorMethod>
  <Constructor id="_812" name="QXLSurface" artificial="1" throw="" context="_327" access="public" mangled="_ZN10QXLSurfaceC1ERKS_ *INTERNAL* " demangled="QXLSurface::QXLSurface(QXLSurface const&amp;)" location="f0:541" file="f0" line="541" endline="541" inline="1">
    <Argument type="_1074" location="f0:541" file="f0" line="541"/>
  </Constructor>
  <Constructor id="_813" name="QXLSurface" artificial="1" throw="" context="_327" access="public" mangled="_ZN10QXLSurfaceC1Ev *INTERNAL* " demangled="QXLSurface::QXLSurface()" location="f0:541" file="f0" line="541" inline="1"/>
  <Field id="_814" name="alpha" type="_307" offset="0" context="_329" access="public" location="f0:431" file="f0" line="431"/>
  <Field id="_815" name="src_bitmap" type="_237" offset="8" context="_329" access="public" location="f0:432" file="f0" line="432"/>
  <Field id="_816" name="src_area" type="_87" offset="72" context="_329" access="public" location="f0:433" file="f0" line="433"/>
  <Destructor id="_817" name="QXLCompatAlphaBlend" artificial="1" throw="" context="_329" access="public" mangled="_ZN19QXLCompatAlphaBlendD1Ev *INTERNAL* " demangled="QXLCompatAlphaBlend::~QXLCompatAlphaBlend()" location="f0:430" file="f0" line="430" endline="430" inline="1">
  </Destructor>
  <OperatorMethod id="_818" name="=" returns="_1075" artificial="1" throw="" context="_329" access="public" mangled="_ZN19QXLCompatAlphaBlendaSERKS_" demangled="QXLCompatAlphaBlend::operator=(QXLCompatAlphaBlend const&amp;)" location="f0:430" file="f0" line="430" endline="430" inline="1">
    <Argument type="_1076" location="f0:430" file="f0" line="430"/>
  </OperatorMethod>
  <Constructor id="_819" name="QXLCompatAlphaBlend" artificial="1" throw="" context="_329" access="public" mangled="_ZN19QXLCompatAlphaBlendC1ERKS_ *INTERNAL* " demangled="QXLCompatAlphaBlend::QXLCompatAlphaBlend(QXLCompatAlphaBlend const&amp;)" location="f0:430" file="f0" line="430" endline="430" inline="1">
    <Argument type="_1076" location="f0:430" file="f0" line="430"/>
  </Constructor>
  <Constructor id="_820" name="QXLCompatAlphaBlend" artificial="1" throw="" context="_329" access="public" mangled="_ZN19QXLCompatAlphaBlendC1Ev *INTERNAL* " demangled="QXLCompatAlphaBlend::QXLCompatAlphaBlend()" location="f0:430" file="f0" line="430" inline="1"/>
  <Field id="_821" name="release_info" type="_57" offset="0" context="_338" access="public" location="f0:482" file="f0" line="482"/>
  <Field id="_822" name="effect" type="_307" offset="64" context="_338" access="public" location="f0:483" file="f0" line="483"/>
  <Field id="_823" name="type" type="_307" offset="72" context="_338" access="public" location="f0:484" file="f0" line="484"/>
  <Field id="_824" name="bitmap_offset" type="_288" offset="80" context="_338" access="public" location="f0:485" file="f0" line="485"/>
  <Field id="_825" name="bitmap_area" type="_87" offset="96" context="_338" access="public" location="f0:486" file="f0" line="486"/>
  <Field id="_826" name="bbox" type="_87" offset="224" context="_338" access="public" location="f0:487" file="f0" line="487"/>
  <Field id="_827" name="clip" type="_303" offset="352" context="_338" access="public" location="f0:488" file="f0" line="488"/>
  <Field id="_828" name="mm_time" type="_149" offset="448" context="_338" access="public" location="f0:489" file="f0" line="489"/>
  <Field id="_829" name="u" type="_830" offset="480" context="_338" access="public" location="f0:504" file="f0" line="504"/>
  <Union id="_830" context="_338" access="public" mangled="N17QXLCompatDrawable4._31E" demangled="QXLCompatDrawable::._31" location="f0:490" file="f0" line="490" artificial="1" size="544" align="8" members="_1077 _1078 _1079 _1080 _1081 _1082 _1083 _1084 _1085 _1086 _1087 _1088 _1089 _1090 _1091 _1092 _1093 " bases=""/>
  <Destructor id="_831" name="QXLCompatDrawable" artificial="1" throw="" context="_338" access="public" mangled="_ZN17QXLCompatDrawableD1Ev *INTERNAL* " demangled="QXLCompatDrawable::~QXLCompatDrawable()" location="f0:481" file="f0" line="481" endline="481" inline="1">
  </Destructor>
  <OperatorMethod id="_832" name="=" returns="_1094" artificial="1" throw="" context="_338" access="public" mangled="_ZN17QXLCompatDrawableaSERKS_" demangled="QXLCompatDrawable::operator=(QXLCompatDrawable const&amp;)" location="f0:481" file="f0" line="481" endline="481" inline="1">
    <Argument type="_1095" location="f0:481" file="f0" line="481"/>
  </OperatorMethod>
  <Constructor id="_833" name="QXLCompatDrawable" artificial="1" throw="" context="_338" access="public" mangled="_ZN17QXLCompatDrawableC1ERKS_ *INTERNAL* " demangled="QXLCompatDrawable::QXLCompatDrawable(QXLCompatDrawable const&amp;)" location="f0:481" file="f0" line="481" endline="481" inline="1">
    <Argument type="_1095" location="f0:481" file="f0" line="481"/>
  </Constructor>
  <Constructor id="_834" name="QXLCompatDrawable" artificial="1" throw="" context="_338" access="public" mangled="_ZN17QXLCompatDrawableC1Ev *INTERNAL* " demangled="QXLCompatDrawable::QXLCompatDrawable()" location="f0:481" file="f0" line="481" inline="1"/>
  <Field id="_835" name="num_items" type="_149" offset="0" context="_340" access="public" location="f0:220" file="f0" line="220"/>
  <Field id="_836" name="prod" type="_149" offset="32" context="_340" access="public" location="f0:220" file="f0" line="220"/>
  <Field id="_837" name="notify_on_prod" type="_149" offset="64" context="_340" access="public" location="f0:220" file="f0" line="220"/>
  <Field id="_838" name="cons" type="_149" offset="96" context="_340" access="public" location="f0:220" file="f0" line="220"/>
  <Field id="_839" name="notify_on_cons" type="_149" offset="128" context="_340" access="public" location="f0:220" file="f0" line="220"/>
  <Field id="_840" name="items" type="_1096" offset="160" context="_340" access="public" location="f0:220" file="f0" line="220"/>
  <Destructor id="_841" name="QXLCommandRing" artificial="1" throw="" context="_340" access="public" mangled="_ZN14QXLCommandRingD1Ev *INTERNAL* " demangled="QXLCommandRing::~QXLCommandRing()" location="f0:220" file="f0" line="220" endline="220" inline="1">
  </Destructor>
  <OperatorMethod id="_842" name="=" returns="_1097" artificial="1" throw="" context="_340" access="public" mangled="_ZN14QXLCommandRingaSERKS_" demangled="QXLCommandRing::operator=(QXLCommandRing const&amp;)" location="f0:220" file="f0" line="220" endline="220" inline="1">
    <Argument type="_1098" location="f0:220" file="f0" line="220"/>
  </OperatorMethod>
  <Constructor id="_843" name="QXLCommandRing" artificial="1" throw="" context="_340" access="public" mangled="_ZN14QXLCommandRingC1ERKS_ *INTERNAL* " demangled="QXLCommandRing::QXLCommandRing(QXLCommandRing const&amp;)" location="f0:220" file="f0" line="220" endline="220" inline="1">
    <Argument type="_1098" location="f0:220" file="f0" line="220"/>
  </Constructor>
  <Constructor id="_844" name="QXLCommandRing" artificial="1" throw="" context="_340" access="public" mangled="_ZN14QXLCommandRingC1Ev *INTERNAL* " demangled="QXLCommandRing::QXLCommandRing()" location="f0:220" file="f0" line="220" inline="1"/>
  <Field id="_845" name="x" type="_152" offset="0" context="_368" access="public" location="f0:104" file="f0" line="104"/>
  <Field id="_846" name="y" type="_152" offset="32" context="_368" access="public" location="f0:105" file="f0" line="105"/>
  <Destructor id="_847" name="QXLPointFix" artificial="1" throw="" context="_368" access="public" mangled="_ZN11QXLPointFixD1Ev *INTERNAL* " demangled="QXLPointFix::~QXLPointFix()" location="f0:103" file="f0" line="103" endline="103" inline="1">
  </Destructor>
  <OperatorMethod id="_848" name="=" returns="_1099" artificial="1" throw="" context="_368" access="public" mangled="_ZN11QXLPointFixaSERKS_" demangled="QXLPointFix::operator=(QXLPointFix const&amp;)" location="f0:103" file="f0" line="103" endline="103" inline="1">
    <Argument type="_1100" location="f0:103" file="f0" line="103"/>
  </OperatorMethod>
  <Constructor id="_849" name="QXLPointFix" artificial="1" throw="" context="_368" access="public" mangled="_ZN11QXLPointFixC1ERKS_ *INTERNAL* " demangled="QXLPointFix::QXLPointFix(QXLPointFix const&amp;)" location="f0:103" file="f0" line="103" endline="103" inline="1">
    <Argument type="_1100" location="f0:103" file="f0" line="103"/>
  </Constructor>
  <Constructor id="_850" name="QXLPointFix" artificial="1" throw="" context="_368" access="public" mangled="_ZN11QXLPointFixC1Ev *INTERNAL* " demangled="QXLPointFix::QXLPointFix()" location="f0:103" file="f0" line="103" inline="1"/>
  <Field id="_851" name="type" type="_149" offset="0" context="_374" access="public" location="f0:380" file="f0" line="380"/>
  <Field id="_852" name="u" type="_853" offset="32" context="_374" access="public" location="f0:384" file="f0" line="384"/>
  <Union id="_853" context="_374" access="public" mangled="N8QXLBrush4._30E" demangled="QXLBrush::._30" location="f0:381" file="f0" line="381" artificial="1" size="128" align="32" members="_1101 _1102 _1103 _1104 _1105 _1106 " bases=""/>
  <Destructor id="_854" name="QXLBrush" artificial="1" throw="" context="_374" access="public" mangled="_ZN8QXLBrushD1Ev *INTERNAL* " demangled="QXLBrush::~QXLBrush()" location="f0:379" file="f0" line="379" endline="379" inline="1">
  </Destructor>
  <OperatorMethod id="_855" name="=" returns="_1107" artificial="1" throw="" context="_374" access="public" mangled="_ZN8QXLBrushaSERKS_" demangled="QXLBrush::operator=(QXLBrush const&amp;)" location="f0:379" file="f0" line="379" endline="379" inline="1">
    <Argument type="_1108" location="f0:379" file="f0" line="379"/>
  </OperatorMethod>
  <Constructor id="_856" name="QXLBrush" artificial="1" throw="" context="_374" access="public" mangled="_ZN8QXLBrushC1ERKS_ *INTERNAL* " demangled="QXLBrush::QXLBrush(QXLBrush const&amp;)" location="f0:379" file="f0" line="379" endline="379" inline="1">
    <Argument type="_1108" location="f0:379" file="f0" line="379"/>
  </Constructor>
  <Constructor id="_857" name="QXLBrush" artificial="1" throw="" context="_374" access="public" mangled="_ZN8QXLBrushC1Ev *INTERNAL* " demangled="QXLBrush::QXLBrush()" location="f0:379" file="f0" line="379" inline="1"/>
  <Field id="_858" name="info" type="_1109" offset="0" context="_376" access="public" location="f0:255" file="f0" line="255"/>
  <Field id="_859" name="group_id" type="_149" offset="64" context="_376" access="public" location="f0:256" file="f0" line="256"/>
  <Destructor id="_860" name="QXLReleaseInfoExt" artificial="1" throw="" context="_376" access="public" mangled="_ZN17QXLReleaseInfoExtD1Ev *INTERNAL* " demangled="QXLReleaseInfoExt::~QXLReleaseInfoExt()" location="f0:254" file="f0" line="254" endline="254" inline="1">
  </Destructor>
  <OperatorMethod id="_861" name="=" returns="_1110" artificial="1" throw="" context="_376" access="public" mangled="_ZN17QXLReleaseInfoExtaSERKS_" demangled="QXLReleaseInfoExt::operator=(QXLReleaseInfoExt const&amp;)" location="f0:254" file="f0" line="254" endline="254" inline="1">
    <Argument type="_1111" location="f0:254" file="f0" line="254"/>
  </OperatorMethod>
  <Constructor id="_862" name="QXLReleaseInfoExt" artificial="1" throw="" context="_376" access="public" mangled="_ZN17QXLReleaseInfoExtC1ERKS_ *INTERNAL* " demangled="QXLReleaseInfoExt::QXLReleaseInfoExt(QXLReleaseInfoExt const&amp;)" location="f0:254" file="f0" line="254" endline="254" inline="1">
    <Argument type="_1111" location="f0:254" file="f0" line="254"/>
  </Constructor>
  <Constructor id="_863" name="QXLReleaseInfoExt" artificial="1" throw="" context="_376" access="public" mangled="_ZN17QXLReleaseInfoExtC1Ev *INTERNAL* " demangled="QXLReleaseInfoExt::QXLReleaseInfoExt()" location="f0:254" file="f0" line="254" inline="1"/>
  <Field id="_864" name="release_info" type="_57" offset="0" context="_383" access="public" location="f0:267" file="f0" line="267"/>
  <Field id="_865" name="data" type="_1112" offset="64" context="_383" access="public" location="f0:268" file="f0" line="268"/>
  <Destructor id="_866" name="QXLMessage" artificial="1" throw="" context="_383" access="public" mangled="_ZN10QXLMessageD1Ev *INTERNAL* " demangled="QXLMessage::~QXLMessage()" location="f0:266" file="f0" line="266" endline="266" inline="1">
  </Destructor>
  <OperatorMethod id="_867" name="=" returns="_1113" artificial="1" throw="" context="_383" access="public" mangled="_ZN10QXLMessageaSERKS_" demangled="QXLMessage::operator=(QXLMessage const&amp;)" location="f0:266" file="f0" line="266" endline="266" inline="1">
    <Argument type="_1114" location="f0:266" file="f0" line="266"/>
  </OperatorMethod>
  <Constructor id="_868" name="QXLMessage" artificial="1" throw="" context="_383" access="public" mangled="_ZN10QXLMessageC1ERKS_ *INTERNAL* " demangled="QXLMessage::QXLMessage(QXLMessage const&amp;)" location="f0:266" file="f0" line="266" endline="266" inline="1">
    <Argument type="_1114" location="f0:266" file="f0" line="266"/>
  </Constructor>
  <Constructor id="_869" name="QXLMessage" artificial="1" throw="" context="_383" access="public" mangled="_ZN10QXLMessageC1Ev *INTERNAL* " demangled="QXLMessage::QXLMessage()" location="f0:266" file="f0" line="266" inline="1"/>
  <Field id="_870" name="magic" type="_149" offset="0" context="_388" access="public" location="f0:234" file="f0" line="234"/>
  <Field id="_871" name="int_pending" type="_149" offset="32" context="_388" access="public" location="f0:235" file="f0" line="235"/>
  <Field id="_872" name="int_mask" type="_149" offset="64" context="_388" access="public" location="f0:236" file="f0" line="236"/>
  <Field id="_873" name="log_buf" type="_1115" offset="96" context="_388" access="public" location="f0:237" file="f0" line="237"/>
  <Field id="_874" name="cmd_ring" type="_341" offset="32864" context="_388" access="public" location="f0:238" file="f0" line="238"/>
  <Field id="_875" name="cursor_ring" type="_106" offset="37120" context="_388" access="public" location="f0:239" file="f0" line="239"/>
  <Field id="_876" name="release_ring" type="_258" offset="41376" context="_388" access="public" location="f0:240" file="f0" line="240"/>
  <Field id="_877" name="update_area" type="_87" offset="42048" context="_388" access="public" location="f0:241" file="f0" line="241"/>
  <Field id="_878" name="update_surface" type="_149" offset="42176" context="_388" access="public" location="f0:243" file="f0" line="243"/>
  <Field id="_879" name="mem_slot" type="_4" offset="42208" context="_388" access="public" location="f0:244" file="f0" line="244"/>
  <Field id="_880" name="create_surface" type="_286" offset="42336" context="_388" access="public" location="f0:245" file="f0" line="245"/>
  <Field id="_881" name="flags" type="_400" offset="42656" context="_388" access="public" location="f0:246" file="f0" line="246"/>
  <Destructor id="_882" name="QXLRam" artificial="1" throw="" context="_388" access="public" mangled="_ZN6QXLRamD1Ev *INTERNAL* " demangled="QXLRam::~QXLRam()" location="f0:233" file="f0" line="233" endline="233" inline="1">
  </Destructor>
  <OperatorMethod id="_883" name="=" returns="_1116" artificial="1" throw="" context="_388" access="public" mangled="_ZN6QXLRamaSERKS_" demangled="QXLRam::operator=(QXLRam const&amp;)" location="f0:233" file="f0" line="233" endline="233" inline="1">
    <Argument type="_1117" location="f0:233" file="f0" line="233"/>
  </OperatorMethod>
  <Constructor id="_884" name="QXLRam" artificial="1" throw="" context="_388" access="public" mangled="_ZN6QXLRamC1ERKS_ *INTERNAL* " demangled="QXLRam::QXLRam(QXLRam const&amp;)" location="f0:233" file="f0" line="233" endline="233" inline="1">
    <Argument type="_1117" location="f0:233" file="f0" line="233"/>
  </Constructor>
  <Constructor id="_885" name="QXLRam" artificial="1" throw="" context="_388" access="public" mangled="_ZN6QXLRamC1Ev *INTERNAL* " demangled="QXLRam::QXLRam()" location="f0:233" file="f0" line="233" inline="1"/>
  <Field id="_886" name="flags" type="_307" offset="0" context="_393" access="public" location="f0:446" file="f0" line="446"/>
  <Field id="_887" name="join_style" type="_307" offset="8" context="_393" access="public" location="f0:447" file="f0" line="447"/>
  <Field id="_888" name="end_style" type="_307" offset="16" context="_393" access="public" location="f0:448" file="f0" line="448"/>
  <Field id="_889" name="style_nseg" type="_307" offset="24" context="_393" access="public" location="f0:449" file="f0" line="449"/>
  <Field id="_890" name="width" type="_152" offset="32" context="_393" access="public" location="f0:450" file="f0" line="450"/>
  <Field id="_891" name="miter_limit" type="_152" offset="64" context="_393" access="public" location="f0:451" file="f0" line="451"/>
  <Field id="_892" name="style" type="_237" offset="96" context="_393" access="public" location="f0:452" file="f0" line="452"/>
  <Destructor id="_893" name="QXLLineAttr" artificial="1" throw="" context="_393" access="public" mangled="_ZN11QXLLineAttrD1Ev *INTERNAL* " demangled="QXLLineAttr::~QXLLineAttr()" location="f0:445" file="f0" line="445" endline="445" inline="1">
  </Destructor>
  <OperatorMethod id="_894" name="=" returns="_1118" artificial="1" throw="" context="_393" access="public" mangled="_ZN11QXLLineAttraSERKS_" demangled="QXLLineAttr::operator=(QXLLineAttr const&amp;)" location="f0:445" file="f0" line="445" endline="445" inline="1">
    <Argument type="_1119" location="f0:445" file="f0" line="445"/>
  </OperatorMethod>
  <Constructor id="_895" name="QXLLineAttr" artificial="1" throw="" context="_393" access="public" mangled="_ZN11QXLLineAttrC1ERKS_ *INTERNAL* " demangled="QXLLineAttr::QXLLineAttr(QXLLineAttr const&amp;)" location="f0:445" file="f0" line="445" endline="445" inline="1">
    <Argument type="_1119" location="f0:445" file="f0" line="445"/>
  </Constructor>
  <Constructor id="_896" name="QXLLineAttr" artificial="1" throw="" context="_393" access="public" mangled="_ZN11QXLLineAttrC1Ev *INTERNAL* " demangled="QXLLineAttr::QXLLineAttr()" location="f0:445" file="f0" line="445" inline="1"/>
  <Field id="_897" name="src_bitmap" type="_237" offset="0" context="_402" access="public" location="f0:437" file="f0" line="437"/>
  <Field id="_898" name="src_area" type="_87" offset="64" context="_402" access="public" location="f0:438" file="f0" line="438"/>
  <Field id="_899" name="brush" type="_375" offset="192" context="_402" access="public" location="f0:439" file="f0" line="439"/>
  <Field id="_900" name="rop3" type="_307" offset="352" context="_402" access="public" location="f0:440" file="f0" line="440"/>
  <Field id="_901" name="scale_mode" type="_307" offset="360" context="_402" access="public" location="f0:441" file="f0" line="441"/>
  <Field id="_902" name="mask" type="_405" offset="368" context="_402" access="public" location="f0:442" file="f0" line="442"/>
  <Destructor id="_903" name="QXLRop3" artificial="1" throw="" context="_402" access="public" mangled="_ZN7QXLRop3D1Ev *INTERNAL* " demangled="QXLRop3::~QXLRop3()" location="f0:436" file="f0" line="436" endline="436" inline="1">
  </Destructor>
  <OperatorMethod id="_904" name="=" returns="_1120" artificial="1" throw="" context="_402" access="public" mangled="_ZN7QXLRop3aSERKS_" demangled="QXLRop3::operator=(QXLRop3 const&amp;)" location="f0:436" file="f0" line="436" endline="436" inline="1">
    <Argument type="_1121" location="f0:436" file="f0" line="436"/>
  </OperatorMethod>
  <Constructor id="_905" name="QXLRop3" artificial="1" throw="" context="_402" access="public" mangled="_ZN7QXLRop3C1ERKS_ *INTERNAL* " demangled="QXLRop3::QXLRop3(QXLRop3 const&amp;)" location="f0:436" file="f0" line="436" endline="436" inline="1">
    <Argument type="_1121" location="f0:436" file="f0" line="436"/>
  </Constructor>
  <Constructor id="_906" name="QXLRop3" artificial="1" throw="" context="_402" access="public" mangled="_ZN7QXLRop3C1Ev *INTERNAL* " demangled="QXLRop3::QXLRop3()" location="f0:436" file="f0" line="436" inline="1"/>
  <Field id="_907" name="flags" type="_307" offset="0" context="_404" access="public" location="f0:388" file="f0" line="388"/>
  <Field id="_908" name="pos" type="_210" offset="8" context="_404" access="public" location="f0:389" file="f0" line="389"/>
  <Field id="_909" name="bitmap" type="_237" offset="72" context="_404" access="public" location="f0:390" file="f0" line="390"/>
  <Destructor id="_910" name="QXLQMask" artificial="1" throw="" context="_404" access="public" mangled="_ZN8QXLQMaskD1Ev *INTERNAL* " demangled="QXLQMask::~QXLQMask()" location="f0:387" file="f0" line="387" endline="387" inline="1">
  </Destructor>
  <OperatorMethod id="_911" name="=" returns="_1122" artificial="1" throw="" context="_404" access="public" mangled="_ZN8QXLQMaskaSERKS_" demangled="QXLQMask::operator=(QXLQMask const&amp;)" location="f0:387" file="f0" line="387" endline="387" inline="1">
    <Argument type="_1123" location="f0:387" file="f0" line="387"/>
  </OperatorMethod>
  <Constructor id="_912" name="QXLQMask" artificial="1" throw="" context="_404" access="public" mangled="_ZN8QXLQMaskC1ERKS_ *INTERNAL* " demangled="QXLQMask::QXLQMask(QXLQMask const&amp;)" location="f0:387" file="f0" line="387" endline="387" inline="1">
    <Argument type="_1123" location="f0:387" file="f0" line="387"/>
  </Constructor>
  <Constructor id="_913" name="QXLQMask" artificial="1" throw="" context="_404" access="public" mangled="_ZN8QXLQMaskC1Ev *INTERNAL* " demangled="QXLQMask::QXLQMask()" location="f0:387" file="f0" line="387" inline="1"/>
  <Field id="_914" name="str" type="_237" offset="0" context="_406" access="public" location="f0:464" file="f0" line="464"/>
  <Field id="_915" name="back_area" type="_87" offset="64" context="_406" access="public" location="f0:465" file="f0" line="465"/>
  <Field id="_916" name="fore_brush" type="_375" offset="192" context="_406" access="public" location="f0:466" file="f0" line="466"/>
  <Field id="_917" name="back_brush" type="_375" offset="352" context="_406" access="public" location="f0:467" file="f0" line="467"/>
  <Field id="_918" name="fore_mode" type="_288" offset="512" context="_406" access="public" location="f0:468" file="f0" line="468"/>
  <Field id="_919" name="back_mode" type="_288" offset="528" context="_406" access="public" location="f0:469" file="f0" line="469"/>
  <Destructor id="_920" name="QXLText" artificial="1" throw="" context="_406" access="public" mangled="_ZN7QXLTextD1Ev *INTERNAL* " demangled="QXLText::~QXLText()" location="f0:463" file="f0" line="463" endline="463" inline="1">
  </Destructor>
  <OperatorMethod id="_921" name="=" returns="_1124" artificial="1" throw="" context="_406" access="public" mangled="_ZN7QXLTextaSERKS_" demangled="QXLText::operator=(QXLText const&amp;)" location="f0:463" file="f0" line="463" endline="463" inline="1">
    <Argument type="_1125" location="f0:463" file="f0" line="463"/>
  </OperatorMethod>
  <Constructor id="_922" name="QXLText" artificial="1" throw="" context="_406" access="public" mangled="_ZN7QXLTextC1ERKS_ *INTERNAL* " demangled="QXLText::QXLText(QXLText const&amp;)" location="f0:463" file="f0" line="463" endline="463" inline="1">
    <Argument type="_1125" location="f0:463" file="f0" line="463"/>
  </Constructor>
  <Constructor id="_923" name="QXLText" artificial="1" throw="" context="_406" access="public" mangled="_ZN7QXLTextC1Ev *INTERNAL* " demangled="QXLText::QXLText()" location="f0:463" file="f0" line="463" inline="1"/>
  <ReferenceType id="_924" type="_3" size="64" align="64"/>
  <ReferenceType id="_925" type="_3c" size="64" align="64"/>
  <ReferenceType id="_928" type="_21" size="64" align="64"/>
  <ReferenceType id="_929" type="_21c" size="64" align="64"/>
  <ArrayType id="_930" min="0" max="0xffffffffffffffffffffffffffffffffu" type="_307" size="0" align="8"/>
  <ReferenceType id="_931" type="_23" size="64" align="64"/>
  <ReferenceType id="_932" type="_23c" size="64" align="64"/>
  <Field id="_933" name="bitmap" type="_231" offset="0" context="_439" access="public" location="f0:650" file="f0" line="650"/>
  <Field id="_934" name="quic" type="_24" offset="0" context="_439" access="public" location="f0:651" file="f0" line="651"/>
  <Field id="_935" name="surface_image" type="_186" offset="0" context="_439" access="public" location="f0:652" file="f0" line="652"/>
  <ReferenceType id="_936" type="_50" size="64" align="64"/>
  <ReferenceType id="_937" type="_50c" size="64" align="64"/>
  <ReferenceType id="_938" type="_56" size="64" align="64"/>
  <ReferenceType id="_939" type="_56c" size="64" align="64"/>
  <ReferenceType id="_940" type="_70" size="64" align="64"/>
  <ReferenceType id="_941" type="_70c" size="64" align="64"/>
  <ArrayType id="_942" min="0" max="0xffffffffffffffffffffffffffffffffu" type="_369" size="0" align="8"/>
  <ReferenceType id="_943" type="_77" size="64" align="64"/>
  <ReferenceType id="_944" type="_77c" size="64" align="64"/>
  <ReferenceType id="_945" type="_86" size="64" align="64"/>
  <ReferenceType id="_946" type="_86c" size="64" align="64"/>
  <Field id="_948" name="el" type="_138" offset="0" context="_481" access="public" location="f0:221" file="f0" line="221"/>
  <Field id="_949" name="data" type="_1134" offset="0" context="_481" access="public" location="f0:221" file="f0" line="221"/>
  <ReferenceType id="_950" type="_99" size="64" align="64"/>
  <ReferenceType id="_951" type="_99c" size="64" align="64"/>
  <Field id="_952" name="el" type="_138" offset="0" context="_487" access="public" location="f0:220" file="f0" line="220"/>
  <Field id="_953" name="data" type="_1134" offset="0" context="_487" access="public" location="f0:220" file="f0" line="220"/>
  <ReferenceType id="_954" type="_103" size="64" align="64"/>
  <ReferenceType id="_955" type="_103c" size="64" align="64"/>
  <ArrayType id="_956" min="0" max="31u" type="_100" size="4096" align="8"/>
  <ReferenceType id="_957" type="_105" size="64" align="64"/>
  <ReferenceType id="_958" type="_105c" size="64" align="64"/>
  <ArrayType id="_959" min="0" max="2u" type="_307" size="24" align="8"/>
  <ReferenceType id="_960" type="_110" size="64" align="64"/>
  <ReferenceType id="_961" type="_110c" size="64" align="64"/>
  <ReferenceType id="_962" type="_115" size="64" align="64"/>
  <ReferenceType id="_963" type="_115c" size="64" align="64"/>
  <ReferenceType id="_964" type="_124" size="64" align="64"/>
  <ReferenceType id="_965" type="_124c" size="64" align="64"/>
  <ArrayType id="_966" min="0" max="0xffffffffffffffffffffffffffffffffu" type="_307" size="0" align="8"/>
  <ReferenceType id="_967" type="_128" size="64" align="64"/>
  <ReferenceType id="_968" type="_128c" size="64" align="64"/>
  <ArrayType id="_969" min="0" max="127u" type="_307" size="1024" align="8"/>
  <Field id="_970" name="set" type="_973" offset="0" context="_555" access="public" location="f0:316" file="f0" line="316"/>
  <Field id="_971" name="trail" type="_974" offset="0" context="_555" access="public" location="f0:320" file="f0" line="320"/>
  <Field id="_972" name="position" type="_125" offset="0" context="_555" access="public" location="f0:321" file="f0" line="321"/>
  <Struct id="_973" context="_555" access="public" mangled="N12QXLCursorCmd4._264._27E" demangled="QXLCursorCmd::._26::._27" location="f0:312" file="f0" line="312" artificial="1" attributes="__packed__" size="104" align="8" members="_1142 _1143 _1144 _1145 _1146 _1147 _1148 " bases=""/>
  <Struct id="_974" context="_555" access="public" mangled="N12QXLCursorCmd4._264._28E" demangled="QXLCursorCmd::._26::._28" location="f0:317" file="f0" line="317" artificial="1" attributes="__packed__" size="32" align="8" members="_1149 _1150 _1151 _1152 _1153 _1154 " bases=""/>
  <Destructor id="_975" name="._26" artificial="1" throw="" context="_555" access="public" mangled="_ZN12QXLCursorCmd4._26D1Ev *INTERNAL* " demangled="QXLCursorCmd::._26::~._26()" location="f0:311" file="f0" line="311" endline="311" inline="1">
  </Destructor>
  <OperatorMethod id="_976" name="=" returns="_1155" artificial="1" throw="" context="_555" access="public" mangled="_ZN12QXLCursorCmd4._26aSERKS0_" demangled="QXLCursorCmd::._26::operator=(QXLCursorCmd::._26 const&amp;)" location="f0:311" file="f0" line="311" endline="311" inline="1">
    <Argument type="_1156" location="f0:311" file="f0" line="311"/>
  </OperatorMethod>
  <Constructor id="_977" artificial="1" throw="" context="_555" access="public" mangled="_ZN12QXLCursorCmd4._26C1ERKS0_ *INTERNAL* " demangled="QXLCursorCmd::._26::._26(QXLCursorCmd::._26 const&amp;)" location="f0:311" file="f0" line="311" endline="311" inline="1">
    <Argument type="_1156" location="f0:311" file="f0" line="311"/>
  </Constructor>
  <Constructor id="_978" artificial="1" throw="" context="_555" access="public" mangled="_ZN12QXLCursorCmd4._26C1Ev *INTERNAL* " demangled="QXLCursorCmd::._26::._26()" location="f0:311" file="f0" line="311" inline="1"/>
  <ReferenceType id="_979" type="_131" size="64" align="64"/>
  <ReferenceType id="_980" type="_131c" size="64" align="64"/>
  <ArrayType id="_981" min="0" max="0xffffffffffffffffffffffffffffffffu" type="_71" size="0" align="8"/>
  <ReferenceType id="_982" type="_135" size="64" align="64"/>
  <ReferenceType id="_983" type="_135c" size="64" align="64"/>
  <ReferenceType id="_984" type="_137" size="64" align="64"/>
  <ReferenceType id="_985" type="_137c" size="64" align="64"/>
  <ReferenceType id="_986" type="_150" size="64" align="64"/>
  <ReferenceType id="_987" type="_150c" size="64" align="64"/>
  <ReferenceType id="_988" type="_155" size="64" align="64"/>
  <ReferenceType id="_989" type="_155c" size="64" align="64"/>
  <ArrayType id="_990" min="0" max="0xffffffffffffffffffffffffffffffffu" type="_307" size="0" align="8"/>
  <ReferenceType id="_991" type="_162" size="64" align="64"/>
  <ReferenceType id="_992" type="_162c" size="64" align="64"/>
  <ReferenceType id="_993" type="_166" size="64" align="64"/>
  <ReferenceType id="_994" type="_166c" size="64" align="64"/>
  <ReferenceType id="_995" type="_172" size="64" align="64"/>
  <ReferenceType id="_996" type="_172c" size="64" align="64"/>
  <ReferenceType id="_997" type="_183" size="64" align="64"/>
  <ReferenceType id="_998" type="_183c" size="64" align="64"/>
  <ReferenceType id="_999" type="_185" size="64" align="64"/>
  <ReferenceType id="_1000" type="_185c" size="64" align="64"/>
  <ReferenceType id="_1001" type="_194" size="64" align="64"/>
  <ReferenceType id="_1002" type="_194c" size="64" align="64"/>
  <Field id="_1003" name="el" type="_400" offset="0" context="_631" access="public" location="f0:223" file="f0" line="223"/>
  <Field id="_1004" name="data" type="_1168" offset="0" context="_631" access="public" location="f0:223" file="f0" line="223"/>
  <ReferenceType id="_1005" type="_207" size="64" align="64"/>
  <ReferenceType id="_1006" type="_207c" size="64" align="64"/>
  <ReferenceType id="_1007" type="_209" size="64" align="64"/>
  <ReferenceType id="_1008" type="_209c" size="64" align="64"/>
  <ReferenceType id="_1009" type="_216" size="64" align="64"/>
  <ReferenceType id="_1010" type="_216c" size="64" align="64"/>
  <ReferenceType id="_1011" type="_228" size="64" align="64"/>
  <ReferenceType id="_1012" type="_228c" size="64" align="64"/>
  <ReferenceType id="_1013" type="_230" size="64" align="64"/>
  <ReferenceType id="_1014" type="_230c" size="64" align="64"/>
  <ReferenceType id="_1015" type="_244" size="64" align="64"/>
  <ReferenceType id="_1016" type="_244c" size="64" align="64"/>
  <ReferenceType id="_1017" type="_247" size="64" align="64"/>
  <ReferenceType id="_1018" type="_247c" size="64" align="64"/>
  <ReferenceType id="_1019" type="_254" size="64" align="64"/>
  <ReferenceType id="_1020" type="_254c" size="64" align="64"/>
  <ArrayType id="_1021" min="0" max="7u" type="_208" size="512" align="8"/>
  <ReferenceType id="_1022" type="_257" size="64" align="64"/>
  <ReferenceType id="_1023" type="_257c" size="64" align="64"/>
  <ReferenceType id="_1024" type="_259" size="64" align="64"/>
  <ReferenceType id="_1025" type="_259c" size="64" align="64"/>
  <ReferenceType id="_1026" type="_261" size="64" align="64"/>
  <ReferenceType id="_1027" type="_261c" size="64" align="64"/>
  <ReferenceType id="_1028" type="_272" size="64" align="64"/>
  <ReferenceType id="_1029" type="_272c" size="64" align="64"/>
  <ArrayType id="_1030" min="0" max="2u" type="_276" size="96" align="32"/>
  <ArrayType id="_1031" min="0" max="2u" type="_87" size="384" align="8"/>
  <Field id="_1032" name="fill" type="_311" offset="0" context="_738" access="public" location="f0:520" file="f0" line="520"/>
  <Field id="_1033" name="opaque" type="_273" offset="0" context="_738" access="public" location="f0:521" file="f0" line="521"/>
  <Field id="_1034" name="copy" type="_253" offset="0" context="_738" access="public" location="f0:522" file="f0" line="522"/>
  <Field id="_1035" name="transparent" type="_248" offset="0" context="_738" access="public" location="f0:523" file="f0" line="523"/>
  <Field id="_1036" name="alpha_blend" type="_195" offset="0" context="_738" access="public" location="f0:524" file="f0" line="524"/>
  <Field id="_1037" name="copy_bits" type="_255" offset="0" context="_738" access="public" location="f0:525" file="f0" line="525"/>
  <Field id="_1038" name="blend" type="_151" offset="0" context="_738" access="public" location="f0:526" file="f0" line="526"/>
  <Field id="_1039" name="rop3" type="_403" offset="0" context="_738" access="public" location="f0:527" file="f0" line="527"/>
  <Field id="_1040" name="stroke" type="_116" offset="0" context="_738" access="public" location="f0:528" file="f0" line="528"/>
  <Field id="_1041" name="text" type="_407" offset="0" context="_738" access="public" location="f0:529" file="f0" line="529"/>
  <Field id="_1042" name="blackness" type="_218" offset="0" context="_738" access="public" location="f0:530" file="f0" line="530"/>
  <Field id="_1043" name="invers" type="_184" offset="0" context="_738" access="public" location="f0:531" file="f0" line="531"/>
  <Field id="_1044" name="whiteness" type="_373" offset="0" context="_738" access="public" location="f0:532" file="f0" line="532"/>
  <Destructor id="_1045" name="._32" artificial="1" throw="" context="_738" access="public" mangled="_ZN11QXLDrawable4._32D1Ev *INTERNAL* " demangled="QXLDrawable::._32::~._32()" location="f0:519" file="f0" line="519" endline="519" inline="1">
  </Destructor>
  <OperatorMethod id="_1046" name="=" returns="_1181" artificial="1" throw="" context="_738" access="public" mangled="_ZN11QXLDrawable4._32aSERKS0_" demangled="QXLDrawable::._32::operator=(QXLDrawable::._32 const&amp;)" location="f0:519" file="f0" line="519" endline="519" inline="1">
    <Argument type="_1182" location="f0:519" file="f0" line="519"/>
  </OperatorMethod>
  <Constructor id="_1047" artificial="1" throw="" context="_738" access="public" mangled="_ZN11QXLDrawable4._32C1ERKS0_ *INTERNAL* " demangled="QXLDrawable::._32::._32(QXLDrawable::._32 const&amp;)" location="f0:519" file="f0" line="519" endline="519" inline="1">
    <Argument type="_1182" location="f0:519" file="f0" line="519"/>
  </Constructor>
  <Constructor id="_1048" artificial="1" throw="" context="_738" access="public" mangled="_ZN11QXLDrawable4._32C1Ev *INTERNAL* " demangled="QXLDrawable::._32::._32()" location="f0:519" file="f0" line="519" inline="1"/>
  <ReferenceType id="_1049" type="_281" size="64" align="64"/>
  <ReferenceType id="_1050" type="_281c" size="64" align="64"/>
  <ReferenceType id="_1051" type="_285" size="64" align="64"/>
  <ReferenceType id="_1052" type="_285c" size="64" align="64"/>
  <Field id="_1053" name="surface_create" type="_328" offset="0" context="_761" access="public" location="f0:555" file="f0" line="555"/>
  <Destructor id="_1054" name="._33" artificial="1" throw="" context="_761" access="public" mangled="_ZN13QXLSurfaceCmd4._33D1Ev *INTERNAL* " demangled="QXLSurfaceCmd::._33::~._33()" location="f0:554" file="f0" line="554" endline="554" inline="1">
  </Destructor>
  <OperatorMethod id="_1055" name="=" returns="_1185" artificial="1" throw="" context="_761" access="public" mangled="_ZN13QXLSurfaceCmd4._33aSERKS0_" demangled="QXLSurfaceCmd::._33::operator=(QXLSurfaceCmd::._33 const&amp;)" location="f0:554" file="f0" line="554" endline="554" inline="1">
    <Argument type="_1186" location="f0:554" file="f0" line="554"/>
  </OperatorMethod>
  <Constructor id="_1056" artificial="1" throw="" context="_761" access="public" mangled="_ZN13QXLSurfaceCmd4._33C1ERKS0_ *INTERNAL* " demangled="QXLSurfaceCmd::._33::._33(QXLSurfaceCmd::._33 const&amp;)" location="f0:554" file="f0" line="554" endline="554" inline="1">
    <Argument type="_1186" location="f0:554" file="f0" line="554"/>
  </Constructor>
  <Constructor id="_1057" artificial="1" throw="" context="_761" access="public" mangled="_ZN13QXLSurfaceCmd4._33C1Ev *INTERNAL* " demangled="QXLSurfaceCmd::._33::._33()" location="f0:554" file="f0" line="554" inline="1"/>
  <ReferenceType id="_1058" type="_290" size="64" align="64"/>
  <ReferenceType id="_1059" type="_290c" size="64" align="64"/>
  <ReferenceType id="_1060" type="_293" size="64" align="64"/>
  <ReferenceType id="_1061" type="_293c" size="64" align="64"/>
  <ReferenceType id="_1062" type="_302" size="64" align="64"/>
  <ReferenceType id="_1063" type="_302c" size="64" align="64"/>
  <ReferenceType id="_1064" type="_305" size="64" align="64"/>
  <ReferenceType id="_1065" type="_305c" size="64" align="64"/>
  <ReferenceType id="_1066" type="_308" size="64" align="64"/>
  <ReferenceType id="_1067" type="_308c" size="64" align="64"/>
  <ReferenceType id="_1068" type="_310" size="64" align="64"/>
  <ReferenceType id="_1069" type="_310c" size="64" align="64"/>
  <ArrayType id="_1070" min="0" max="0xffffffffffffffffffffffffffffffffu" type="_149" size="0" align="32"/>
  <ReferenceType id="_1071" type="_312" size="64" align="64"/>
  <ReferenceType id="_1072" type="_312c" size="64" align="64"/>
  <ReferenceType id="_1073" type="_327" size="64" align="64"/>
  <ReferenceType id="_1074" type="_327c" size="64" align="64"/>
  <ReferenceType id="_1075" type="_329" size="64" align="64"/>
  <ReferenceType id="_1076" type="_329c" size="64" align="64"/>
  <Field id="_1077" name="fill" type="_311" offset="0" context="_830" access="public" location="f0:491" file="f0" line="491"/>
  <Field id="_1078" name="opaque" type="_273" offset="0" context="_830" access="public" location="f0:492" file="f0" line="492"/>
  <Field id="_1079" name="copy" type="_253" offset="0" context="_830" access="public" location="f0:493" file="f0" line="493"/>
  <Field id="_1080" name="transparent" type="_248" offset="0" context="_830" access="public" location="f0:494" file="f0" line="494"/>
  <Field id="_1081" name="alpha_blend" type="_330" offset="0" context="_830" access="public" location="f0:495" file="f0" line="495"/>
  <Field id="_1082" name="copy_bits" type="_255" offset="0" context="_830" access="public" location="f0:496" file="f0" line="496"/>
  <Field id="_1083" name="blend" type="_151" offset="0" context="_830" access="public" location="f0:497" file="f0" line="497"/>
  <Field id="_1084" name="rop3" type="_403" offset="0" context="_830" access="public" location="f0:498" file="f0" line="498"/>
  <Field id="_1085" name="stroke" type="_116" offset="0" context="_830" access="public" location="f0:499" file="f0" line="499"/>
  <Field id="_1086" name="text" type="_407" offset="0" context="_830" access="public" location="f0:500" file="f0" line="500"/>
  <Field id="_1087" name="blackness" type="_218" offset="0" context="_830" access="public" location="f0:501" file="f0" line="501"/>
  <Field id="_1088" name="invers" type="_184" offset="0" context="_830" access="public" location="f0:502" file="f0" line="502"/>
  <Field id="_1089" name="whiteness" type="_373" offset="0" context="_830" access="public" location="f0:503" file="f0" line="503"/>
  <Destructor id="_1090" name="._31" artificial="1" throw="" context="_830" access="public" mangled="_ZN17QXLCompatDrawable4._31D1Ev *INTERNAL* " demangled="QXLCompatDrawable::._31::~._31()" location="f0:490" file="f0" line="490" endline="490" inline="1">
  </Destructor>
  <OperatorMethod id="_1091" name="=" returns="_1196" artificial="1" throw="" context="_830" access="public" mangled="_ZN17QXLCompatDrawable4._31aSERKS0_" demangled="QXLCompatDrawable::._31::operator=(QXLCompatDrawable::._31 const&amp;)" location="f0:490" file="f0" line="490" endline="490" inline="1">
    <Argument type="_1197" location="f0:490" file="f0" line="490"/>
  </OperatorMethod>
  <Constructor id="_1092" artificial="1" throw="" context="_830" access="public" mangled="_ZN17QXLCompatDrawable4._31C1ERKS0_ *INTERNAL* " demangled="QXLCompatDrawable::._31::._31(QXLCompatDrawable::._31 const&amp;)" location="f0:490" file="f0" line="490" endline="490" inline="1">
    <Argument type="_1197" location="f0:490" file="f0" line="490"/>
  </Constructor>
  <Constructor id="_1093" artificial="1" throw="" context="_830" access="public" mangled="_ZN17QXLCompatDrawable4._31C1Ev *INTERNAL* " demangled="QXLCompatDrawable::._31::._31()" location="f0:490" file="f0" line="490" inline="1"/>
  <ReferenceType id="_1094" type="_338" size="64" align="64"/>
  <ReferenceType id="_1095" type="_338c" size="64" align="64"/>
  <ArrayType id="_1096" min="0" max="31u" type="_104" size="4096" align="8"/>
  <ReferenceType id="_1097" type="_340" size="64" align="64"/>
  <ReferenceType id="_1098" type="_340c" size="64" align="64"/>
  <ReferenceType id="_1099" type="_368" size="64" align="64"/>
  <ReferenceType id="_1100" type="_368c" size="64" align="64"/>
  <Field id="_1101" name="color" type="_149" offset="0" context="_853" access="public" location="f0:382" file="f0" line="382"/>
  <Field id="_1102" name="pattern" type="_167" offset="0" context="_853" access="public" location="f0:383" file="f0" line="383"/>
  <Destructor id="_1103" name="._30" artificial="1" throw="" context="_853" access="public" mangled="_ZN8QXLBrush4._30D1Ev *INTERNAL* " demangled="QXLBrush::._30::~._30()" location="f0:381" file="f0" line="381" endline="381" inline="1">
  </Destructor>
  <OperatorMethod id="_1104" name="=" returns="_1201" artificial="1" throw="" context="_853" access="public" mangled="_ZN8QXLBrush4._30aSERKS0_" demangled="QXLBrush::._30::operator=(QXLBrush::._30 const&amp;)" location="f0:381" file="f0" line="381" endline="381" inline="1">
    <Argument type="_1202" location="f0:381" file="f0" line="381"/>
  </OperatorMethod>
  <Constructor id="_1105" artificial="1" throw="" context="_853" access="public" mangled="_ZN8QXLBrush4._30C1ERKS0_ *INTERNAL* " demangled="QXLBrush::._30::._30(QXLBrush::._30 const&amp;)" location="f0:381" file="f0" line="381" endline="381" inline="1">
    <Argument type="_1202" location="f0:381" file="f0" line="381"/>
  </Constructor>
  <Constructor id="_1106" artificial="1" throw="" context="_853" access="public" mangled="_ZN8QXLBrush4._30C1Ev *INTERNAL* " demangled="QXLBrush::._30::._30()" location="f0:381" file="f0" line="381" inline="1"/>
  <ReferenceType id="_1107" type="_374" size="64" align="64"/>
  <ReferenceType id="_1108" type="_374c" size="64" align="64"/>
  <PointerType id="_1109" type="_57" size="64" align="64"/>
  <ReferenceType id="_1110" type="_376" size="64" align="64"/>
  <ReferenceType id="_1111" type="_376c" size="64" align="64"/>
  <ArrayType id="_1112" min="0" max="0xffffffffffffffffffffffffffffffffu" type="_307" size="0" align="8"/>
  <ReferenceType id="_1113" type="_383" size="64" align="64"/>
  <ReferenceType id="_1114" type="_383c" size="64" align="64"/>
  <ArrayType id="_1115" min="0" max="4095u" type="_307" size="32768" align="8"/>
  <ReferenceType id="_1116" type="_388" size="64" align="64"/>
  <ReferenceType id="_1117" type="_388c" size="64" align="64"/>
  <ReferenceType id="_1118" type="_393" size="64" align="64"/>
  <ReferenceType id="_1119" type="_393c" size="64" align="64"/>
  <ReferenceType id="_1120" type="_402" size="64" align="64"/>
  <ReferenceType id="_1121" type="_402c" size="64" align="64"/>
  <ReferenceType id="_1122" type="_404" size="64" align="64"/>
  <ReferenceType id="_1123" type="_404c" size="64" align="64"/>
  <ReferenceType id="_1124" type="_406" size="64" align="64"/>
  <ReferenceType id="_1125" type="_406c" size="64" align="64"/>
  <ArrayType id="_1134" min="0" max="15u" type="_307" size="128" align="8"/>
  <Field id="_1142" name="position" type="_125" offset="0" context="_973" access="public" location="f0:313" file="f0" line="313"/>
  <Field id="_1143" name="visible" type="_307" offset="32" context="_973" access="public" location="f0:314" file="f0" line="314"/>
  <Field id="_1144" name="shape" type="_237" offset="40" context="_973" access="public" location="f0:315" file="f0" line="315"/>
  <Destructor id="_1145" name="._27" artificial="1" throw="" context="_973" access="public" mangled="_ZN12QXLCursorCmd4._264._27D1Ev *INTERNAL* " demangled="QXLCursorCmd::._26::._27::~._27()" location="f0:312" file="f0" line="312" endline="312" inline="1">
  </Destructor>
  <OperatorMethod id="_1146" name="=" returns="_1211" artificial="1" throw="" context="_973" access="public" mangled="_ZN12QXLCursorCmd4._264._27aSERKS1_" demangled="QXLCursorCmd::._26::._27::operator=(QXLCursorCmd::._26::._27 const&amp;)" location="f0:312" file="f0" line="312" endline="312" inline="1">
    <Argument type="_1212" location="f0:312" file="f0" line="312"/>
  </OperatorMethod>
  <Constructor id="_1147" artificial="1" throw="" context="_973" access="public" mangled="_ZN12QXLCursorCmd4._264._27C1ERKS1_ *INTERNAL* " demangled="QXLCursorCmd::._26::._27::._27(QXLCursorCmd::._26::._27 const&amp;)" location="f0:312" file="f0" line="312" endline="312" inline="1">
    <Argument type="_1212" location="f0:312" file="f0" line="312"/>
  </Constructor>
  <Constructor id="_1148" artificial="1" throw="" context="_973" access="public" mangled="_ZN12QXLCursorCmd4._264._27C1Ev *INTERNAL* " demangled="QXLCursorCmd::._26::._27::._27()" location="f0:312" file="f0" line="312" inline="1"/>
  <Field id="_1149" name="length" type="_288" offset="0" context="_974" access="public" location="f0:318" file="f0" line="318"/>
  <Field id="_1150" name="frequency" type="_288" offset="16" context="_974" access="public" location="f0:319" file="f0" line="319"/>
  <Destructor id="_1151" name="._28" artificial="1" throw="" context="_974" access="public" mangled="_ZN12QXLCursorCmd4._264._28D1Ev *INTERNAL* " demangled="QXLCursorCmd::._26::._28::~._28()" location="f0:317" file="f0" line="317" endline="317" inline="1">
  </Destructor>
  <OperatorMethod id="_1152" name="=" returns="_1213" artificial="1" throw="" context="_974" access="public" mangled="_ZN12QXLCursorCmd4._264._28aSERKS1_" demangled="QXLCursorCmd::._26::._28::operator=(QXLCursorCmd::._26::._28 const&amp;)" location="f0:317" file="f0" line="317" endline="317" inline="1">
    <Argument type="_1214" location="f0:317" file="f0" line="317"/>
  </OperatorMethod>
  <Constructor id="_1153" artificial="1" throw="" context="_974" access="public" mangled="_ZN12QXLCursorCmd4._264._28C1ERKS1_ *INTERNAL* " demangled="QXLCursorCmd::._26::._28::._28(QXLCursorCmd::._26::._28 const&amp;)" location="f0:317" file="f0" line="317" endline="317" inline="1">
    <Argument type="_1214" location="f0:317" file="f0" line="317"/>
  </Constructor>
  <Constructor id="_1154" artificial="1" throw="" context="_974" access="public" mangled="_ZN12QXLCursorCmd4._264._28C1Ev *INTERNAL* " demangled="QXLCursorCmd::._26::._28::._28()" location="f0:317" file="f0" line="317" inline="1"/>
  <ReferenceType id="_1155" type="_555" size="64" align="64"/>
  <ReferenceType id="_1156" type="_555c" size="64" align="64"/>
  <ArrayType id="_1168" min="0" max="7u" type="_307" size="64" align="8"/>
  <ReferenceType id="_1181" type="_738" size="64" align="64"/>
  <ReferenceType id="_1182" type="_738c" size="64" align="64"/>
  <ReferenceType id="_1185" type="_761" size="64" align="64"/>
  <ReferenceType id="_1186" type="_761c" size="64" align="64"/>
  <ReferenceType id="_1196" type="_830" size="64" align="64"/>
  <ReferenceType id="_1197" type="_830c" size="64" align="64"/>
  <ReferenceType id="_1201" type="_853" size="64" align="64"/>
  <ReferenceType id="_1202" type="_853c" size="64" align="64"/>
  <ReferenceType id="_1211" type="_973" size="64" align="64"/>
  <ReferenceType id="_1212" type="_973c" size="64" align="64"/>
  <ReferenceType id="_1213" type="_974" size="64" align="64"/>
  <ReferenceType id="_1214" type="_974c" size="64" align="64"/>
  <FundamentalType id="_926" name="char" size="8" align="8"/>
  <CvQualifiedType id="_926c" type="_926" const="1"/>
  <CvQualifiedType id="_462c" type="_462" const="1"/>
  <CvQualifiedType id="_368c" type="_368" const="1"/>
  <CvQualifiedType id="_209c" type="_209" const="1"/>
  <CvQualifiedType id="_124c" type="_124" const="1"/>
  <CvQualifiedType id="_86c" type="_86" const="1"/>
  <CvQualifiedType id="_110c" type="_110" const="1"/>
  <CvQualifiedType id="_70c" type="_70" const="1"/>
  <CvQualifiedType id="_135c" type="_135" const="1"/>
  <CvQualifiedType id="_137c" type="_137" const="1"/>
  <CvQualifiedType id="_155c" type="_155" const="1"/>
  <CvQualifiedType id="_3c" type="_3" const="1"/>
  <CvQualifiedType id="_285c" type="_285" const="1"/>
  <CvQualifiedType id="_103c" type="_103" const="1"/>
  <CvQualifiedType id="_340c" type="_340" const="1"/>
  <CvQualifiedType id="_99c" type="_99" const="1"/>
  <CvQualifiedType id="_105c" type="_105" const="1"/>
  <CvQualifiedType id="_207c" type="_207" const="1"/>
  <CvQualifiedType id="_257c" type="_257" const="1"/>
  <CvQualifiedType id="_388c" type="_388" const="1"/>
  <CvQualifiedType id="_56c" type="_56" const="1"/>
  <CvQualifiedType id="_376c" type="_376" const="1"/>
  <CvQualifiedType id="_128c" type="_128" const="1"/>
  <CvQualifiedType id="_383c" type="_383" const="1"/>
  <CvQualifiedType id="_228c" type="_228" const="1"/>
  <CvQualifiedType id="_21c" type="_21" const="1"/>
  <CvQualifiedType id="_244c" type="_244" const="1"/>
  <CvQualifiedType id="_305c" type="_305" const="1"/>
  <CvQualifiedType id="_973c" type="_973" const="1"/>
